Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="FUSERID" edc:nzwidth="0x20" edc:impl="0xFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x0000FFFF" edc:access="----------------nnnnnnnnnnnnnnnn" edc:_addr="0x805F88" edc:default="0x0000FFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="USER_ID" edc:nzwidth="0x10" edc:desc="User unique ID, readable using the SWD USER_ID instruction"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="DEVCFG4" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x840e4000" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x805F8C" edc:default="0x840e4000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="SOSCCFG" edc:nzwidth="0x8" edc:desc="SOSC Configuration"/>
            <edc:DCRFieldDef edc:cname="RTCEVENT_SEL" edc:nzwidth="0x2" edc:desc="RTC Event Selection">
              <edc:DCRFieldSemantic edc:cname="ONE_SEC" edc:desc="1-Second Clock" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ALARM_PULSE" edc:desc="Alarm Pulse" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="_32_KHZ" edc:desc="32 kHz Clock" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RTCEVENT_EN" edc:nzwidth="0x1" edc:desc="Pad Output Enable for MCHP legacy RTC event output">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enable RTC Event" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disable RTC Event" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="VBKP_1KCSEL" edc:nzwidth="0x1" edc:desc="VDDBUKPCORE LPCLK Clock Selection">
              <edc:DCRFieldSemantic edc:cname="_1K" edc:desc="Divide by 32 or 31.25 clock depending on VBKP_DIVSEL" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="_32K" edc:desc="32kHz low power clock" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="VBKP_32KCSEL" edc:nzwidth="0x2" edc:desc="VDDBUKPCORE 32kHz clock source selection">
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="FRC" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="POSC" edc:desc="POSC" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="SOSC" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="LPRC" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="VBKP_DIVSEL" edc:nzwidth="0x1" edc:desc="VDDBUKPCORE LPCLK Clock Divider Selection">
              <edc:DCRFieldSemantic edc:cname="DIV_31_25" edc:desc="Divide by 31.25 (Recommended when LPCLK=32kHz)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="DIV_32" edc:desc="Divide-by 32 (Recommended when LPCLK=32.768kHz))" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LPCLK_MOD" edc:nzwidth="0x1" edc:desc="LPCLK modifier in counter/delay mode">
              <edc:DCRFieldSemantic edc:cname="DIV_1" edc:desc="Divide-by 1 (Recommended when LPCLK=32kHz)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="DIV_1_024" edc:desc="Divide-by 1.024 (Recommended when LPCLK=32.768kHz)" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RTCEVTYPE" edc:nzwidth="0x1" edc:desc="RTC Event Type">
              <edc:DCRFieldSemantic edc:cname="EVENT" edc:desc="RTC_EVENT" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="OUT" edc:desc="RTC_OUT" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CPEN_DLY" edc:nzwidth="0x3" edc:desc="Charge-pump ready digital delay">
              <edc:DCRFieldSemantic edc:cname="_1_LPRC" edc:desc="1 LPRC Clock Cycle Delay" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="_2_LPRC" edc:desc="2 LPRC Clock Cycle Delay" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="_3_LPRC" edc:desc="3 LPRC Clock Cycle Delay" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="_4_LPRC" edc:desc="4 LPRC Clock Cycle Delay" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="_5_LPRC" edc:desc="5 LPRC Clock Cycle Delay" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:DCRFieldSemantic edc:cname="_6_LPRC" edc:desc="6 LPRC Clock Cycle Delay" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:DCRFieldSemantic edc:cname="_7_LPRC" edc:desc="7 LPRC Clock Cycle Delay" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:DCRFieldSemantic edc:cname="_8_LPRC" edc:desc="8 LPRC Clock Cycle Delay" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSZPBOREN" edc:nzwidth="0x1" edc:desc="Deep Sleep Zero-Power BOR Enable">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTPS" edc:nzwidth="0x5" edc:desc="Deep Sleep Watchdog Timer Postscale Select">
              <edc:DCRFieldSemantic edc:cname="DSPS5" edc:desc="1:32(1ms)" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="DSPS6" edc:desc="1:64(2.1ms)" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="DSPS7" edc:desc="1:128(4.1ms)" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="DSPS8" edc:desc="1:256(8.3ms)" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="DSPS9" edc:desc="1:512(16.5ms)" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:DCRFieldSemantic edc:cname="DSPS10" edc:desc="1:1024(33ms)" edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:DCRFieldSemantic edc:cname="DSPS11" edc:desc="1:2048(66.1ms)" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:DCRFieldSemantic edc:cname="DSPS12" edc:desc="1:4096(132.1ms)" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:DCRFieldSemantic edc:cname="DSPS13" edc:desc="1:8192(264.3ms)" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:DCRFieldSemantic edc:cname="DSPS14" edc:desc="1:16384(528.5ms)" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:DCRFieldSemantic edc:cname="DSPS15" edc:desc="1:32768(1.057s)" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:DCRFieldSemantic edc:cname="DSPS16" edc:desc="1:65536(2.114s)" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:DCRFieldSemantic edc:cname="DSPS17" edc:desc="1:2^17(4.288s)" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:DCRFieldSemantic edc:cname="DSPS18" edc:desc="1:2^18(8.456s)" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:DCRFieldSemantic edc:cname="DSPS19" edc:desc="1:2^19(16.912s)" edc:when="(field &amp; 0x1F) == 0x0E"/>
              <edc:DCRFieldSemantic edc:cname="DSPS20" edc:desc="1:2^20(33.825s)" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:DCRFieldSemantic edc:cname="DSPS21" edc:desc="1:2^21(67.7s)" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="DSPS22" edc:desc="1:2^22(135.3s)" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="DSPS23" edc:desc="1:2^23(4.5 minutes)" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="DSPS24" edc:desc="1:2^24(9.0 minutes)" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="DSPS25" edc:desc="1:2^25(18.0 minutes)" edc:when="(field &amp; 0x1F) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="DSPS26" edc:desc="1:2^26(36.1 minutes)" edc:when="(field &amp; 0x1F) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="DSPS27" edc:desc="1:2^27(72.2 minutes)" edc:when="(field &amp; 0x1F) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="DSPS28" edc:desc="1:2^28(2.4 hours)" edc:when="(field &amp; 0x1F) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="DSPS29" edc:desc="1:2^29(4.8 hours)" edc:when="(field &amp; 0x1F) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="DSPS30" edc:desc="1:2^30(9.6 hours)" edc:when="(field &amp; 0x1F) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="DSPS31" edc:desc="1:2^31(19.2 hours)" edc:when="(field &amp; 0x1F) == 0x1A"/>
              <edc:DCRFieldSemantic edc:cname="DSPS32" edc:desc="1:2^32(38.5 hours)" edc:when="(field &amp; 0x1F) == 0x1B"/>
              <edc:DCRFieldSemantic edc:cname="DSPS33" edc:desc="1:2^33(77.0 hours)" edc:when="(field &amp; 0x1F) == 0x1C"/>
              <edc:DCRFieldSemantic edc:cname="DSPS34" edc:desc="1:2^34(6.4 days)" edc:when="(field &amp; 0x1F) == 0x1D"/>
              <edc:DCRFieldSemantic edc:cname="DSPS35" edc:desc="1:2^35(12.8 days)" edc:when="(field &amp; 0x1F) == 0x1E"/>
              <edc:DCRFieldSemantic edc:cname="DSPS36" edc:desc="1:2^36(25.7 days)" edc:when="(field &amp; 0x1F) == 0x1F"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTOSC" edc:nzwidth="0x1" edc:desc="Deep Sleep Watchdog Timer Reference Clock Select">
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Select SOSC as DSWDT Reference Clock" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Select LPRC as DSWDT Reference Clock" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTEN" edc:nzwidth="0x1" edc:desc="Deep Sleep Watchdog Timer Enable">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSEN" edc:nzwidth="0x1" edc:desc="Deep Sleep Bit Enable">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enable DS Bit in DSCON" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disable DS Bit in DSCON" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="UVREGROVR" edc:nzwidth="0x1" edc:desc="ULPVREG Retention Mode Override">
              <edc:DCRFieldSemantic edc:cname="FORCED" edc:desc="ULPVREG forced in retention mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="CONTROLLED" edc:desc="ULPVREG controlled by XDS/DS FSM" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LPOSCEN" edc:nzwidth="0x1" edc:desc="Low Power (Secondary) Oscillator Enable">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disable" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RTCNTM_CSEL" edc:nzwidth="0x1" edc:desc="RTC Counter Mode Clock Select">
              <edc:DCRFieldSemantic edc:cname="RAW" edc:desc="Raw 32kHz clock" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="PROCESSED" edc:desc="Processed 32kHz clock" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
