Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="DEVCFG1" edc:nzwidth="0x20" edc:impl="0x7FF7FBE0" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x1410443b" edc:access="-nnnnnnnnnnn-nnnnnnnn-nnnnn-----" edc:_addr="0x805F94" edc:default="0x1410443b">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:DCRFieldDef edc:cname="TRCEN" edc:nzwidth="0x1" edc:desc="Trace Enable">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ECC_SEL_MEM" edc:nzwidth="0x1" edc:desc="ECC row selection bit">
              <edc:DCRFieldSemantic edc:cname="ROWA" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ROWB" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ZBTWKSYS" edc:nzwidth="0x1" edc:desc="ZBT Subsystem External Wake-up source">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CMP0_OE" edc:nzwidth="0x1" edc:desc="Analog Comparator-0 Output Enable">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CMP1_OE" edc:nzwidth="0x1" edc:desc="Analog Comparator-1 Output Enable">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="SLRCTRL0" edc:nzwidth="0x1" edc:desc="I2C Slew Rate Control for SERCOM0">
              <edc:DCRFieldSemantic edc:cname="GPIO" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="SERCOM" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SLRCTRL1" edc:nzwidth="0x1" edc:desc="I2C Slew Rate Control for SERCOM1">
              <edc:DCRFieldSemantic edc:cname="GPIO" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="SERCOM" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SLRCTRL2" edc:nzwidth="0x1" edc:desc="I2C Slew Rate Control for SERCOM2">
              <edc:DCRFieldSemantic edc:cname="GPIO" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="SERCOM" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SMCLR" edc:nzwidth="0x1" edc:desc="Selects CRU handling of MCLR Control">
              <edc:DCRFieldSemantic edc:cname="NO_POR" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="FAUX_POR" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="QSCHE_EN" edc:nzwidth="0x1" edc:desc="QSPI Address Space Cache Attribute">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="QSPI_HSEN" edc:nzwidth="0x1" edc:desc="QSPI Direct (High Speed) Pin Enable">
              <edc:DCRFieldSemantic edc:cname="PPS" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="DIRECT" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SCOM0_HSEN" edc:nzwidth="0x1" edc:desc="SERCOM0 Direct (High Speed) Pin Enable">
              <edc:DCRFieldSemantic edc:cname="PPS" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="DIRECT" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SCOM1_HSEN" edc:nzwidth="0x1" edc:desc="SERCOM1 Direct (High Speed) Pin Enable">
              <edc:DCRFieldSemantic edc:cname="PPS" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="DIRECT" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="CCL_OE" edc:nzwidth="0x1" edc:desc="CCL Pads (via PPS) Output Enable">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="I2CDSEL0" edc:nzwidth="0x1" edc:desc="I2C Delay Select for SERCOM0">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="I2CDSEL1" edc:nzwidth="0x1" edc:desc="I2C Delay Select for SERCOM1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="I2CDSEL2" edc:nzwidth="0x1" edc:desc="I2C Delay Select for SERCOM2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTPSS" edc:nzwidth="0x5" edc:desc="Watchdog Timer Post-scale Select Sleep">
              <edc:DCRFieldSemantic edc:cname="PSS1" edc:desc="1:1" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="PSS2" edc:desc="1:2" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="PSS4" edc:desc="1:4" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="PSS8" edc:desc="1:8" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="PSS16" edc:desc="1:16" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:DCRFieldSemantic edc:cname="PSS32" edc:desc="1:32" edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:DCRFieldSemantic edc:cname="PSS64" edc:desc="1:64" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:DCRFieldSemantic edc:cname="PSS128" edc:desc="1:128" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:DCRFieldSemantic edc:cname="PSS256" edc:desc="1:256" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:DCRFieldSemantic edc:cname="PSS512" edc:desc="1:512" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:DCRFieldSemantic edc:cname="PSS1024" edc:desc="1:1024" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:DCRFieldSemantic edc:cname="PSS2048" edc:desc="1:2048" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:DCRFieldSemantic edc:cname="PSS4096" edc:desc="1:4096" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:DCRFieldSemantic edc:cname="PSS8192" edc:desc="1:8192" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:DCRFieldSemantic edc:cname="PSS16384" edc:desc="1:16384" edc:when="(field &amp; 0x1F) == 0x0E"/>
              <edc:DCRFieldSemantic edc:cname="PSS32768" edc:desc="1:32768" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:DCRFieldSemantic edc:cname="PSS65536" edc:desc="1:65536" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="PSS131072" edc:desc="1:131072" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="PSS262144" edc:desc="1:262144" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="PSS524288" edc:desc="1:524288" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="PSS1048576" edc:desc="1:1048576" edc:when="(field &amp; 0x1F) == 0x14"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="QSPIDDRM" edc:nzwidth="0x1" edc:desc="QSPI DDR Mode Clock Enable">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CLKZBREF" edc:nzwidth="0x1" edc:desc="External Reference Clock ZB Enable">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="DEVCFG0" edc:nzwidth="0x20" edc:impl="0x77F603D6" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x7100000b" edc:access="-nnn-nnnnnnn-nn-------nnnn-n-nn-" edc:_addr="0x805F98" edc:default="0x7100000b">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="SWOEN" edc:nzwidth="0x1" edc:desc="SWO enable on 2-wire debug interface">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="TROEN" edc:nzwidth="0x1" edc:desc="Trace Output Enable">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="ADCPOVR" edc:nzwidth="0x1" edc:desc="ADC Charge Pump Override">
              <edc:DCRFieldSemantic edc:cname="HW" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="SW" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="ACCMP1_ALTEN" edc:nzwidth="0x1" edc:desc="AC CMP1 Alternate Enable">
              <edc:DCRFieldSemantic edc:cname="PA6" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="PA13" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CPENFILT" edc:nzwidth="0x1" edc:desc="ADC CP Filter Enable">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RTCIN0_ALTEN" edc:nzwidth="0x1" edc:desc="RTCIN0 Alternate Enable">
              <edc:DCRFieldSemantic edc:cname="PA3" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="PA9" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RTCOUT_ALTEN" edc:nzwidth="0x1" edc:desc="RTCOUT Alternate Enable">
              <edc:DCRFieldSemantic edc:cname="PA4" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="PA10" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:DCRFieldDef edc:cname="SMBUSEN0" edc:nzwidth="0x1" edc:desc="SMBus Enable for SERCOM0">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SMBUSEN1" edc:nzwidth="0x1" edc:desc="SMBus Enable for SERCOM1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="HPLUGDIS" edc:nzwidth="0x1" edc:desc="Hot Plugging Disable">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SLRTEN0" edc:nzwidth="0x1" edc:desc="SLRT Enable for SERCOM0">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SLRTEN1" edc:nzwidth="0x1" edc:desc="SLRT Enable for SERCOM1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SLRTEN2" edc:nzwidth="0x1" edc:desc="SLRT Enable for SERCOM2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PCM" edc:nzwidth="0x1" edc:desc="PCHE I/D Cacheable Mode">
              <edc:DCRFieldSemantic edc:cname="CPU" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="SFR" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="INT0E" edc:nzwidth="0x1" edc:desc="INT0 Enable">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="INT0P" edc:nzwidth="0x1" edc:desc="INT0P Polarity">
              <edc:DCRFieldSemantic edc:cname="NEG" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="POS" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="FECCCON" edc:nzwidth="0x2" edc:desc="Flash ECC Control">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="DYNAMIC" edc:desc="" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FRECCDIS" edc:nzwidth="0x1" edc:desc="Flex RAM ECC Control">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="FBCFG0" edc:nzwidth="0x20" edc:impl="0x80000002" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x00000002" edc:access="n-----------------------------n-" edc:_addr="0x805F9C" edc:default="0x00000002">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="PCSCMODE" edc:nzwidth="0x1" edc:desc="PCache Single cache Mode">
              <edc:DCRFieldSemantic edc:cname="SINGLE" edc:desc="PCHE ICache Only.CPU Instructions (code, data) go to PCHE ONLY." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="DUAL" edc:desc="PCHE ICache and DCache. CPU opcodes go to PCEHE ICache port and data goes to PCHE" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1D"/>
            <edc:DCRFieldDef edc:cname="BINFOVALID" edc:nzwidth="0x1" edc:desc="BCFG info valid">
              <edc:DCRFieldSemantic edc:cname="NOT_VALID" edc:desc="BCFG0 to BCFG7 is not valid." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="VALID" edc:desc="BCFG0 to BCFG7 is valid." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:unimplval="0x0" edc:offset="0x10" edc:_addr="0x805FA0"/>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="FCPN3" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x805FB0" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="FCPN3" edc:nzwidth="0x20" edc:desc="RESERVED"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="FCPN2" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x805FB4" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="FCPN2" edc:nzwidth="0x20" edc:desc="RESERVED"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="FCPN1" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x805FB8" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="FCPN1" edc:nzwidth="0x20" edc:desc="RESERVED"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="FCPN0" edc:nzwidth="0x20" edc:impl="0x10000000" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x10000000" edc:access="---n----------------------------" edc:_addr="0x805FBC" edc:default="0x10000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:AdjustPoint edc:offset="0x1C"/>
            <edc:DCRFieldDef edc:cname="CP" edc:nzwidth="0x1" edc:desc="Boot Code Protect">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="ENABLED" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:BootConfigSector edc:regionid="FCR_OTP_PAGE" edc:beginaddr="0x806000" edc:endaddr="0x807000" atdf:pagesize="0x1000" edc:isotp="true" edc:rw="r"/>
    <edc:GPRDataSector edc:regionid="CMCC_TCM" edc:beginaddr="0x2000000" edc:endaddr="0x2001000" edc:rw="rw"/>
    <edc:GPRDataSector edc:regionid="RAM_SYSTEM_RAM" edc:beginaddr="0x20000000" edc:endaddr="0x20018000" edc:isexecutable="true" edc:rw="rw"/>
    <edc:ExternalSector edc:regionid="QSPI" edc:beginaddr="0x4000000" edc:endaddr="0x5000000" edc:isexecutable="true" edc:rw="rw" edc:accessprotocol="qspi" edc:type="flash"/>
    <edc:SFRDataSector edc:regionid="PBA_BRIDGE" edc:beginaddr="0x40000000" edc:endaddr="0x40003C88" edc:rw="rw">
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="WRCTRL" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x40000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PERID" edc:nzwidth="0x10" edc:desc="Peripheral identifier"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Peripheral access control key">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No action" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CLR" edc:desc="Clear protection" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set protection" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SETLCK" edc:desc="Set and lock protection" edc:when="(field &amp; 0xFF) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERREO" edc:nzwidth="0x1" edc:desc="Peripheral acess error event output"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40000005"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Peripheral access error interrupt disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
