Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER44" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x410061D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x6" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER45" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x410061D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x6" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER46" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x410061D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x6" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER47" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x410061DC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x6" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER48" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x410061E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x6" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER49" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x410061E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x6" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER50" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x410061E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x6" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER51" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x410061EC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x6" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER52" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x410061F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x6" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER53" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x410061F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x6" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER54" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x410061F8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x6" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER55" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x410061FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x6" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER56" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x41006200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x6" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1DFC" edc:_addr="0x41006204"/>
      <edc:SFRDef ltx:memberofperipheral="RAMECC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x41008000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="SINGLEE" edc:nzwidth="0x1" edc:desc="Single Bit ECC Error Interrupt Enable Clear"/>
            <edc:SFRFieldDef edc:cname="DUALE" edc:nzwidth="0x1" edc:desc="Dual Bit ECC Error Interrupt Enable Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RAMECC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x41008001">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="SINGLEE" edc:nzwidth="0x1" edc:desc="Single Bit ECC Error Interrupt Enable Set"/>
            <edc:SFRFieldDef edc:cname="DUALE" edc:nzwidth="0x1" edc:desc="Dual Bit ECC Error Interrupt Enable Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RAMECC" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x41008002">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="SINGLEE" edc:nzwidth="0x1" edc:desc="Single Bit ECC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="DUALE" edc:nzwidth="0x1" edc:desc="Dual Bit ECC Error Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RAMECC" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="-------r" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x41008003">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="ECCDIS" edc:nzwidth="0x1" edc:desc="ECC Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RAMECC" edc:cname="ERRADDR" edc:nzwidth="0x20" edc:access="--------------rrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFF" edc:_addr="0x41008004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="ERRADDR" edc:nzwidth="0x12" edc:desc="Error Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x7" edc:_addr="0x41008008"/>
      <edc:SFRDef ltx:memberofperipheral="RAMECC" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x4100800F">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="ECCDIS" edc:nzwidth="0x1" edc:desc="ECC Disable"/>
            <edc:SFRFieldDef edc:cname="ECCELOG" edc:nzwidth="0x1" edc:desc="ECC Error Log"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8FF0" edc:_addr="0x41008010"/>
      <edc:SFRDef ltx:memberofperipheral="ARB" edc:cname="ARB_BT_CTRL" edc:nzwidth="0x20" edc:access="----------------------nnnnnnnnnn" edc:por="00000000000000000000000000001010" edc:mclr="00000000000000000000000000001010" edc:impl="0x3FF" edc:_addr="0x41011000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="MAX_ABORT_TIME_BT" edc:nzwidth="0x8" edc:desc="BT max abort time"/>
            <edc:SFRFieldDef edc:cname="ALLOW_OPT_RX_BT" edc:nzwidth="0x1" edc:desc="BT allow optimistic rx"/>
            <edc:SFRFieldDef edc:cname="ALLOW_OPT_TX_BT" edc:nzwidth="0x1" edc:desc="BT allow optimistic tx"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ARB" edc:cname="ARB_ZB_CTRL" edc:nzwidth="0x20" edc:access="----------------------nnnnnnnnnn" edc:por="00000000000000000000000000001010" edc:mclr="00000000000000000000000000001010" edc:impl="0x3FF" edc:_addr="0x41011004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="MAX_ABORT_TIME_ZB" edc:nzwidth="0x8" edc:desc="ZB max abort time"/>
            <edc:SFRFieldDef edc:cname="ALLOW_OPT_RX_ZB" edc:nzwidth="0x1" edc:desc="ZB allow optimistic rx"/>
            <edc:SFRFieldDef edc:cname="ALLOW_OPT_TX_ZB" edc:nzwidth="0x1" edc:desc="ZB allow optimistic tx"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ARB" edc:cname="ARB_EVENT_CTRL" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FF" edc:_addr="0x41011008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="START_TIME_ALLOWANCE" edc:nzwidth="0x4" edc:desc="minimum change needed in the start time to be considered as an arbitration event."/>
            <edc:SFRFieldDef edc:cname="USE_END_TIME_AS_EVENT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USE_START_TIME_AS_EVENT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USE_PRIO_AS_EVENT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DELAYED_OK_TASKS_DONT_WAIT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESOLVE_EQUAL_PRIO" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ABORT_IN_STATIC_MODE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ARB" edc:cname="ARB_CORE_CTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000101000000" edc:mclr="00000000000000000000000101000000" edc:_addr="0x4101100C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="RADIO_ARB_MODE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TESTBUS_SELECT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CFG_CDC_ADJ_VAL" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="AD_ARB_SOFT_RESET" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARB_TESTBUS_BYTE_SELECT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RESERVED_1" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="RAD_ARB_TIMEOUT" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ARB" edc:cname="ARB_CORE_STATUS" edc:nzwidth="0x20" edc:access="---------------------rrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FF" edc:_addr="0x41011010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="ARB_CORE_STATE" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="NEXT_RADIO_OWNER" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CUR_RADIO_OWNER" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CUR_REQ_PRI" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ARB" edc:cname="ARB_INT_STATUS" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x41011014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="BT_ABORT_HIZB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ZB_ABORT_HIBT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BT_RADIO_TO_ABRT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ZB_RADIO_TO_ABRT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BT_TIMESENSE_REQ_LOSS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ZB_TIMESENSE_REQ_LOSS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COLLISION_PREDICTED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARB_IDLE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ARB" edc:cname="ARB_INT_MASK" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x41011018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="BT_ABORT_HIZB_MSK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ZB_ABORT_HIBT_MSK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BT_RADIO_TO_ABRT_MSK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ZB_RADIO_TO_ABRT_MSK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BT_TIMESENSE_REQ_LOSS_MSK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ZB_TIMESENSE_REQ_LOSS_MSK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COLLISION_PREDICTED_MSK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARB_IDLE_MSK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x149C" edc:_addr="0x4101101C"/>
      <edc:SFRDef ltx:memberofperipheral="BLE" edc:cname="DPLL_RG1" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0x410124B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BLE">
            <edc:SFRFieldDef edc:cname="DPLL_RG1BITS" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
