Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="BTZBSYS" edc:cname="SUBSYS_STATUS_REG1" edc:nzwidth="0x20" edc:access="-----------------------rrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FF" edc:_addr="0x41014024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BTZBSYS">
            <edc:SFRFieldDef edc:cname="xtal_ready_out" edc:nzwidth="0x1" edc:desc="xtal_ready_out"/>
            <edc:SFRFieldDef edc:cname="pll_lock_out" edc:nzwidth="0x1" edc:desc="pll_lock_out"/>
            <edc:SFRFieldDef edc:cname="XTAL_ready" edc:nzwidth="0x1" edc:desc="XTAL_ready"/>
            <edc:SFRFieldDef edc:cname="PLL_locked" edc:nzwidth="0x1" edc:desc="PLL_locked"/>
            <edc:SFRFieldDef edc:cname="clk_lp_ready" edc:nzwidth="0x1" edc:desc="clk_lp_ready"/>
            <edc:SFRFieldDef edc:cname="clk_mux_sel" edc:nzwidth="0x2" edc:desc="clk_mux_sel0"/>
            <edc:SFRFieldDef edc:cname="pll_lock_fifo_empty" edc:nzwidth="0x1" edc:desc="XTAL_ready"/>
            <edc:SFRFieldDef edc:cname="pllc_ready_cnt_expire_raw" edc:nzwidth="0x1" edc:desc="pllc_ready_cnt_expire_raw"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="BTZBSYS" edc:cname="SUBSYS_STATUS_REG2" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x41014028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BTZBSYS">
            <edc:SFRFieldDef edc:cname="VERSION_NUM" edc:nzwidth="0x8" edc:desc="VERSION_NUM"/>
            <edc:SFRFieldDef edc:cname="PART_NUM" edc:nzwidth="0x8" edc:desc="PART_NUM"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:regionid="PBC_BRIDGE" edc:beginaddr="0x42000000" edc:endaddr="0x42011014" edc:rw="rw">
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="CTRLA" edc:nzwidth="0x20" edc:access="-------n----------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1000003" edc:_addr="0x42000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:AdjustPoint edc:offset="0x16"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:nzwidth="0x1" edc:desc="Last Transfer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="CTRLB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----nnnn--nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF0F3F" edc:_addr="0x42000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x1" edc:desc="Serial Memory Mode">
              <edc:SFRFieldSemantic edc:cname="SPI" edc:desc="SPI operating mode" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MEMORY" edc:desc="Serial Memory operating mode" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LOOPEN" edc:nzwidth="0x1" edc:desc="Local Loopback Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Local Loopback is disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Local Loopback is enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WDRBT" edc:nzwidth="0x1" edc:desc="Wait Data Read Before Transfer"/>
            <edc:SFRFieldDef edc:cname="SMEMREG" edc:nzwidth="0x1" edc:desc="Serial Memory reg"/>
            <edc:SFRFieldDef edc:cname="CSMODE" edc:nzwidth="0x2" edc:desc="Chip Select Mode">
              <edc:SFRFieldSemantic edc:cname="NORELOAD" edc:desc="The chip select is deasserted if TD has not been reloaded before the end of the current transfer." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LASTXFER" edc:desc="The chip select is deasserted when the bit LASTXFER is written at 1 and the character written in TD has been transferred." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SYSTEMATICALLY" edc:desc="The chip select is deasserted systematically after each transfer." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DATALEN" edc:nzwidth="0x4" edc:desc="Data Length">
              <edc:SFRFieldSemantic edc:cname="8BITS" edc:desc="8-bits transfer" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="9BITS" edc:desc="9 bits transfer" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="10BITS" edc:desc="10-bits transfer" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="11BITS" edc:desc="11-bits transfer" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="12BITS" edc:desc="12-bits transfer" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="13BITS" edc:desc="13-bits transfer" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="14BITS" edc:desc="14-bits transfer" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="15BITS" edc:desc="15-bits transfer" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="16BITS" edc:desc="16-bits transfer" edc:when="(field &amp; 0xF) == 0x08"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:nzwidth="0x8" edc:desc="Delay Between Consecutive Transfers"/>
            <edc:SFRFieldDef edc:cname="DLYCS" edc:nzwidth="0x8" edc:desc="Minimum Inactive CS Delay"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="BAUD" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnn------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF03" edc:_addr="0x42000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="CPOL" edc:nzwidth="0x1" edc:desc="Clock Polarity"/>
            <edc:SFRFieldDef edc:cname="CPHA" edc:nzwidth="0x1" edc:desc="Clock Phase"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="BAUD" edc:nzwidth="0x8" edc:desc="Serial Clock Baud Rate"/>
            <edc:SFRFieldDef edc:cname="DLYBS" edc:nzwidth="0x8" edc:desc="Delay Before SCK"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
