Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0DMA_PUSH_ADDR_LSB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43010010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="PUSH_ADDR_LSB" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0DMA_PUSH_ADDR_MSB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43010014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="PUSH_ADDR_MSB" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0DMA_PUSH_LEN" edc:nzwidth="0x20" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFFFFFF" edc:_addr="0x43010018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="PUSH_LEN" edc:nzwidth="0x1C"/>
            <edc:SFRFieldDef edc:cname="PUSH_CSTADDR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUSH_REALIGN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUSH_DISCARD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0DMA_INT_EN" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4301001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="INT_EN" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0DMA_INT_ENSET" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43010020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="INT_ENSET" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0DMA_INT_ENCLR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43010024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="INT_ENCLR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0DMA_INT_STATRAW" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43010028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="INT_STATRAW" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0DMA_INT_STAT" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4301002C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="INT_STAT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0DMA_INT_STATCLR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43010030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="INT_STATCLR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0DMA_CONFIG" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F" edc:_addr="0x43010034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="FETCH_CTRL_INDIRECT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUSH_CTRL_INDIRECT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FETCH_STOP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUSH_STOP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFT_RST" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0DMA_START" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x43010038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="START_FETCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="START_PUSH" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0DMA_STATUS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrr---------rrr--rr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF0073" edc:_addr="0x4301003C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="FETCH_BUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUSH_BUSY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FETCH_NOT_EMPTY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUSH_WAITINGFIFO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFT_RST_BUSY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="PUSH_NBDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3C0" edc:_addr="0x43010040"/>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0HWCONF_INCL_IPS_HW_CFG" edc:nzwidth="0x20" edc:access="------------------rrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFF" edc:_addr="0x43010400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="BA411_AES_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludeAES value. BA411E-AES IP included if set"/>
            <edc:SFRFieldDef edc:cname="BA415_HP_AES_GCM_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludeAESGCM value. BA415-HP-AES-GCM IP included if set"/>
            <edc:SFRFieldDef edc:cname="BA416_HP_AES_XTS_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludeAESXTS value. BA416-HP-AES-XTS IP included if set"/>
            <edc:SFRFieldDef edc:cname="BA412_DES_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludeDES value. BA412-3DES IP included if set"/>
            <edc:SFRFieldDef edc:cname="BA413_HASH_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludeHASH value. BA413-HASH IP included if set"/>
            <edc:SFRFieldDef edc:cname="BA417_CHACHAPOLY_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludeChachaPoly value. BA417-ChaChaPoly IP included if set"/>
            <edc:SFRFieldDef edc:cname="BA418_SHA3_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludeSHA3  value. BA418-SHA3 IP included if set"/>
            <edc:SFRFieldDef edc:cname="BA421_ZUC_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludeZUC  value. BA421-ZUC IP included if set"/>
            <edc:SFRFieldDef edc:cname="BA419_SM4_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludeSM4  value. BA419-SM4 IP included if set"/>
            <edc:SFRFieldDef edc:cname="BA414EP_PKE_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludePKE  value. BA414EP-PKE IP included if set"/>
            <edc:SFRFieldDef edc:cname="BA431_NDRNG_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludeNDRNG  value. BA431-NDRNG IP included if set"/>
            <edc:SFRFieldDef edc:cname="BA420_HP_CHACHAPOLY_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludeHPChachaPoly  value. BA420-HP-ChaChaPoly IP included if set"/>
            <edc:SFRFieldDef edc:cname="BA423_SNOW3G_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludeSnow3G  value. BA423-Snow3G IP included if set"/>
            <edc:SFRFieldDef edc:cname="BA422_KASUMI_INCLUDED" edc:nzwidth="0x1" edc:desc="Generic g_IncludeKasumi  value. BA422-Kasumi IP included if set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0HWCONF_BA411E_AES_HW_CFG_1" edc:nzwidth="0x20" edc:access="-----rrr------rr-------rrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x70301FF" edc:_addr="0x43010404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="BA411E_AES_HW_CFG_MODE" edc:nzwidth="0x9" edc:desc="Generic g_AesModesPoss value. BA411E-AES engine configuration."/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="BA411E_AES_HW_CFG_CS" edc:nzwidth="0x1" edc:desc="Generic g_CS value. BA411E-AES engine configuration."/>
            <edc:SFRFieldDef edc:cname="BA411E_AES_HW_CFG_MASKING" edc:nzwidth="0x1" edc:desc="Generic g_UseMasking value. BA411E-AES engine configuration."/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="BA411E_AES_HW_CFG_KEYSIZE" edc:nzwidth="0x3" edc:desc="Generic g_Keysize value. BA411E-AES engine configuration."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0HWCONF_BA411E_AES_HW_CFG_2" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x43010408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="BA411E_AES_HW_CFG_2" edc:nzwidth="0x10" edc:desc="Generic g_CtrSize value. BA411E-AES engine configuration."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0HWCONF_BA413_HASH_HW_CFG" edc:nzwidth="0x20" edc:access="-------------rrr---------rrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7007F" edc:_addr="0x4301040C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="BA413_HASH_HW_CFG_MASK" edc:nzwidth="0x7" edc:desc="Generic g_HashMaskFunc value. BA413-Hash engine configuration."/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BA413_HASH_HW_CFG_PASSING" edc:nzwidth="0x1" edc:desc="Generic g_HashPadding value. BA413-Hash engine configuration."/>
            <edc:SFRFieldDef edc:cname="BA413_HASH_HW_CFG_HMAC" edc:nzwidth="0x1" edc:desc="Generic g_HMAC_enabled value. BA413-Hash engine configuration."/>
            <edc:SFRFieldDef edc:cname="BA413_HASH_HW_CFG_VERIFYDIGEST" edc:nzwidth="0x1" edc:desc="Generic g_HashVerifyDigest value. BA413-Hash engine configuration."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0HWCONF_BA418_SHA3_HW_CFG" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x43010410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="BA418_SHA3_HW_CFG" edc:nzwidth="0x1" edc:desc="Generic g_Sha3CtxtEn value. BA418-SHA3 configuration."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
