Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0HWCONF_BA419_SM4_HW_CFG" edc:nzwidth="0x20" edc:access="-------------------------rrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F" edc:_addr="0x43010414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="BA419_SM4_HW_CFG" edc:nzwidth="0x7" edc:desc="Generic g_SM4ModesPoss value. BA419-SM4 engine configuration."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0HWCONF_BA424_ARIA_HW_CFG" edc:nzwidth="0x20" edc:access="-----------------------rrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FF" edc:_addr="0x43010418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="BA424_ARIA_HW_CFG" edc:nzwidth="0x9" edc:desc="Generic g_aria_modePoss value. BA424-Aria engine configuration."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xBE4" edc:_addr="0x4301041C"/>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_CONTROL" edc:nzwidth="0x20" edc:access="-----------nnnnnnnnnnnnnn-nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FFFBF" edc:_addr="0x43011000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable the NDRNG."/>
            <edc:SFRFieldDef edc:cname="LFSREN" edc:nzwidth="0x1" edc:desc="Select between the NDRNG with asynchronous free running oscillators (when '0') and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when '1')."/>
            <edc:SFRFieldDef edc:cname="TESTEN" edc:nzwidth="0x1" edc:desc="Select input for conditioning function and continuous tests: 0: Noise source (normal mode), 1: Test data register (test mode)."/>
            <edc:SFRFieldDef edc:cname="CONDBYPASS" edc:nzwidth="0x1" edc:desc="0: the conditioning function is used (normal mode), 1: the conditioning function is bypassed (to observe entropy source directly)."/>
            <edc:SFRFieldDef edc:cname="INTENREP" edc:nzwidth="0x1" edc:desc="Interrupt enable for Repetition Count Test failure."/>
            <edc:SFRFieldDef edc:cname="INTENPROP" edc:nzwidth="0x1" edc:desc="Interrupt enable for Adaptive Proportion Test failure (1024-sample window)."/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INTENFULL" edc:nzwidth="0x1" edc:desc="Interrupt enable for FIFO full."/>
            <edc:SFRFieldDef edc:cname="SOFTRST" edc:nzwidth="0x1" edc:desc="Software reset: 0: Normal mode, 1: The continuous test, the conditioning function and the FIFO are reset. This bit is not cleared automatically."/>
            <edc:SFRFieldDef edc:cname="INTENPRE" edc:nzwidth="0x1" edc:desc="Interrupt enable for AIS31 preliminary noise alarm."/>
            <edc:SFRFieldDef edc:cname="INTENALM" edc:nzwidth="0x1" edc:desc="Interrupt enable for AIS31 noise alarm."/>
            <edc:SFRFieldDef edc:cname="FORCEACTIVEROS" edc:nzwidth="0x1" edc:desc="Force oscillators to run when FIFO is full."/>
            <edc:SFRFieldDef edc:cname="HEALTHTESTBYPASS" edc:nzwidth="0x1" edc:desc="Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state."/>
            <edc:SFRFieldDef edc:cname="AIS31BYPASS" edc:nzwidth="0x1" edc:desc="Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state."/>
            <edc:SFRFieldDef edc:cname="HEALTHTESTSEL" edc:nzwidth="0x1" edc:desc="Select input to health test module: 0: Before conditioning, 1: After conditioning."/>
            <edc:SFRFieldDef edc:cname="AIS31TESTSEL" edc:nzwidth="0x1" edc:desc="Select input to the AIS31 test module: 0: Before conditioning, 1: After conditioning."/>
            <edc:SFRFieldDef edc:cname="NB128BITBLOCKS" edc:nzwidth="0x4" edc:desc="Number of 128 bit blocks used in AES-CBCMAC post-processing. This value cannot be zero."/>
            <edc:SFRFieldDef edc:cname="FIFOWRITESTARTUP" edc:nzwidth="0x1" edc:desc="Enable write of the samples in the FIFO during start-up."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_FIFOLEVEL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43011004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="FIFOLEVEL" edc:nzwidth="0x20" edc:desc="Number of 32 bits words of random available in the FIFO. Any write to this register clears the FullInt flag in the Status register."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_FIFOTHRESHOLD" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43011008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="FIFOTHRESHOLD" edc:nzwidth="0x20" edc:desc="FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_FIFODEPTH" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4301100C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="FIFODEPTH" edc:nzwidth="0x20" edc:desc="Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_KEY0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43011010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="KEY0" edc:nzwidth="0x20" edc:desc="Key register (MSB)."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
