Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0PK_COMMAND" edc:nzwidth="0x20" edc:access="nnnn-nnn-nnnn-nnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000001111" edc:mclr="00000000000000000000000000001111" edc:impl="0xF77BFFFF" edc:_addr="0x43012004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="OPEADDR" edc:nzwidth="0x7" edc:desc="This field defines the operation to be performed. See documentation for more details."/>
            <edc:SFRFieldDef edc:cname="FIELDF" edc:nzwidth="0x1" edc:desc="'0': Field is GF(p) '1': Field is GF(2**m)"/>
            <edc:SFRFieldDef edc:cname="OPBYTESM1" edc:nzwidth="0xA" edc:desc="This field defines the size (= number of bytes minus one) of the operands for the current operation. Possible values are limited by the maximum supported operand size. Examples: - 0x014 -&gt; ECC on curve K-163 - 0x01F -&gt; ECC on curve P-256 - 0x02F -&gt; ECC on curve P-384 - 0x033 -&gt; ECC on curve K-409 - 0x041 -&gt; ECC on curve P-521 - 0x07F -&gt; 1024-bit RSA - 0x09F -&gt; 1280-bit RSA - 0x1FF -&gt; 4096-bit RSA - 0x3FF -&gt; 8192-bit RSA"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RANDMOD" edc:nzwidth="0x1" edc:desc="Enable randomization of modulus (counter-measure)."/>
            <edc:SFRFieldDef edc:cname="SELCURVE" edc:nzwidth="0x3" edc:desc="Enable accelerator for specific curve modulus: 0x0: No acceleration (default) 0x1: P256 0x2: P384 0x3: P521 0x4: P192 0x5: Curve25519 0x6: Ed25519 This field has no effect when the optional acceleration hardware is not included."/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RANDKE" edc:nzwidth="0x1" edc:desc="Enable randomization of exponent/scalar (counter-measure)."/>
            <edc:SFRFieldDef edc:cname="RANDPROJ" edc:nzwidth="0x1" edc:desc="Enable randomization of projective coordinates (counter-measure)."/>
            <edc:SFRFieldDef edc:cname="EDWARDS" edc:nzwidth="0x1" edc:desc="Enable Edwards curve (see operation description)."/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAPBYTES" edc:nzwidth="0x1" edc:desc="Swap the bytes on AHB interface: '0': Native format (little endian) '1': Byte swapped (big endian) See also section 4.2.1. This bit must be programmed before writing/reading any data in data memory."/>
            <edc:SFRFieldDef edc:cname="FLAGA" edc:nzwidth="0x1" edc:desc="See operation description."/>
            <edc:SFRFieldDef edc:cname="FLAGB" edc:nzwidth="0x1" edc:desc="See operation description."/>
            <edc:SFRFieldDef edc:cname="CALCR2" edc:nzwidth="0x1" edc:desc="This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to '1' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. '0': don't recalculate R**2 mod N '1': re-calculate R**2 mod N"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0PK_CONTROL" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x43012008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x1" edc:desc="Writing a '1' starts the processing."/>
            <edc:SFRFieldDef edc:cname="CLEARIRQ" edc:nzwidth="0x1" edc:desc="Writing a '1' clears the IRQ output."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0PK_STATUS" edc:nzwidth="0x20" edc:access="---rrrrr------rrrrrrrrrrrrrr----" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F03FFF0" edc:_addr="0x4301200C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRORFLAGS" edc:nzwidth="0xC" edc:desc="These bits indicate an error condition. They are updated at the end of the operation. They are cleared when starting a new operation. See documentation for more details."/>
            <edc:SFRFieldDef edc:cname="PK_BUSY" edc:nzwidth="0x1" edc:desc="This bit reflects the BUSY output value. It is set when the operation starts and it is cleared when the operation is finished."/>
            <edc:SFRFieldDef edc:cname="INTRPTSTATUS" edc:nzwidth="0x1" edc:desc="This bit reflects the IRQ output value. It is set when the operation is finished. It is cleared when the CPU writes the bit 1 of Control Register."/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="FAILPTR" edc:nzwidth="0x5" edc:desc="These bits indicate which data location generated the error flag. They are not available for all error flags."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x43012010"/>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0PK_TIMER" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43012014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="TIMER" edc:nzwidth="0x20" edc:desc="Number of core clock cycles."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0PK_HWCONFIG" edc:nzwidth="0x20" edc:access="rrr---rrrrrr--rrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xE3F3FFFF" edc:_addr="0x43012018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="MAXOPSIZE" edc:nzwidth="0xC" edc:desc="Maximum operand size (number of bytes)."/>
            <edc:SFRFieldDef edc:cname="NBMULT" edc:nzwidth="0x4" edc:desc="Number of multipliers: 0x0: 1 multiplier 0x1: 4 multipliers 0x2: 16 multipliers 0x4: 64 multipliers 0x8: 256 multipliers"/>
            <edc:SFRFieldDef edc:cname="PRIMEFIELD" edc:nzwidth="0x1" edc:desc="Support prime field."/>
            <edc:SFRFieldDef edc:cname="BINARYFIELD" edc:nzwidth="0x1" edc:desc="Support binary field."/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="P256" edc:nzwidth="0x1" edc:desc="Support ECC P256 acceleration."/>
            <edc:SFRFieldDef edc:cname="P384" edc:nzwidth="0x1" edc:desc="Support ECC P384 acceleration."/>
            <edc:SFRFieldDef edc:cname="P521" edc:nzwidth="0x1" edc:desc="Support ECC P521 acceleration."/>
            <edc:SFRFieldDef edc:cname="P192" edc:nzwidth="0x1" edc:desc="Support ECC P192 acceleration."/>
            <edc:SFRFieldDef edc:cname="X25519" edc:nzwidth="0x1" edc:desc="Support Curve25519/Ed25519 acceleration."/>
            <edc:SFRFieldDef edc:cname="AHBMASTER" edc:nzwidth="0x1" edc:desc="'0': Memory access through AHB Slave and internally in the PKE.                                                                             '1': Memory access through AHB Master, outside the PKE."/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DISABLESMX" edc:nzwidth="0x1" edc:desc="State of DisableSMx input (high when SM2/SM9 operations are disabled)."/>
            <edc:SFRFieldDef edc:cname="DISABLECLRMEM" edc:nzwidth="0x1" edc:desc="State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled)."/>
            <edc:SFRFieldDef edc:cname="DISABLECM" edc:nzwidth="0x1" edc:desc="State of DisableCM input (high when counter-measures are disabled)."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0PK_OPSIZE" edc:nzwidth="0x20" edc:access="-------------------nnnnnnnnnnnnn" edc:por="00000000000000000001000000000000" edc:mclr="00000000000000000001000000000000" edc:impl="0x1FFF" edc:_addr="0x4301201C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="OPSIZE" edc:nzwidth="0xD" edc:desc="Operand size (number of bytes): 0x0100: 256 0x0209: 521 0x0800: 2048 0x0C00: 3072 0x1000: 4096 This register is used when the memory is accessed via AHB Master"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0PK_MEMOFFSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43012020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="MEMOFFSET" edc:nzwidth="0x20" edc:desc="Memory offset for AHB Master"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0PK_MICROCODEOFFSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43012024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="MICROCODEOFFSET" edc:nzwidth="0x20" edc:desc="MicroCode offset for AHB Master"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
