Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_KEY2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43014018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="KEY2" edc:nzwidth="0x20" edc:desc="Key register."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_KEY3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4301401C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="KEY3" edc:nzwidth="0x20" edc:desc="Key register (LSB)."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_TESTDATA" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43014020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="TESTDATA" edc:nzwidth="0x20" edc:desc="Test data register."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_REPEATTHRESHOLD" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43014024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="REPEATTHRESHOLD" edc:nzwidth="0x20" edc:desc="Repetition Test Count Cut-Off value."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_PROPTHRESHOLD" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43014028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="PROPTHRESHOLD" edc:nzwidth="0x20" edc:desc="Adaptive Proportion Test (1024-sample window) Cut-Off value."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4301402C"/>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_STATUS" edc:nzwidth="0x20" edc:access="--------------------nnnnn-nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFBF" edc:_addr="0x43014030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="TESTDATABUSY" edc:nzwidth="0x1" edc:desc="High when data written to TestData register is being processed. (see section 4.7)"/>
            <edc:SFRFieldDef edc:cname="STATE" edc:nzwidth="0x3" edc:desc="State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused."/>
            <edc:SFRFieldDef edc:cname="REPFAIL" edc:nzwidth="0x1" edc:desc="NIST-800-90B repetition Count Test interrupt status."/>
            <edc:SFRFieldDef edc:cname="PROPFAIL" edc:nzwidth="0x1" edc:desc="NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status."/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FULLINT" edc:nzwidth="0x1" edc:desc="FIFO full status."/>
            <edc:SFRFieldDef edc:cname="PREINT" edc:nzwidth="0x1" edc:desc="AIS31 preliminary noise alarm interrupt status."/>
            <edc:SFRFieldDef edc:cname="ALMINT" edc:nzwidth="0x1" edc:desc="AIS31 noise alarm interrupt status."/>
            <edc:SFRFieldDef edc:cname="STARTUPFAIL" edc:nzwidth="0x1" edc:desc="Start-up test failure."/>
            <edc:SFRFieldDef edc:cname="FIFOACCFAIL" edc:nzwidth="0x1" edc:desc="Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0)."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_INITWAITVAL" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000001111111111111111" edc:mclr="00000000000000001111111111111111" edc:impl="0xFFFF" edc:_addr="0x43014034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="INITWAITVAL" edc:nzwidth="0x10" edc:desc="Number of clock cycles to wait before sampling data from the noise source."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_DISABLEOSC0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43014038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="DISABLEOSC0" edc:nzwidth="0x20" edc:desc="Disable oscillator rings #0 to #31."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_DISABLEOSC1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4301403C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="DISABLEOSC1" edc:nzwidth="0x20" edc:desc="Disable oscillator rings #32 to #63."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_SWOFFTMRVAL" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x43014040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="SWOFFTMRVAL" edc:nzwidth="0x10" edc:desc="Number of clk cycles to wait before stopping the rings after the FIFO is full."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_CLKDIV" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x43014044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="CLKDIV" edc:nzwidth="0x8" edc:desc="Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1)."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_AIS31CONF0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43014048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="STARTUPTHRESHOLD" edc:nzwidth="0x10" edc:desc="Start-up test threshold."/>
            <edc:SFRFieldDef edc:cname="ONLINETHRESHOLD" edc:nzwidth="0x10" edc:desc="Online threshold."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_AIS31CONF1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4301404C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="ONLINEREPTHRESHOLD" edc:nzwidth="0x10" edc:desc="Online repeat threshold."/>
            <edc:SFRFieldDef edc:cname="HEXPECTEDVALUE" edc:nzwidth="0x10" edc:desc="Expected history value."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_AIS31CONF2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43014050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="HMIN" edc:nzwidth="0x10" edc:desc="Minimum allowed history value."/>
            <edc:SFRFieldDef edc:cname="HMAX" edc:nzwidth="0x10" edc:desc="Maximum allowed history value."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_AIS31STATUS" edc:nzwidth="0x20" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFF" edc:_addr="0x43014054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="NUMPRELIMALARMS" edc:nzwidth="0x10" edc:desc="Number of preliminary noise alarms since counter was last cleared."/>
            <edc:SFRFieldDef edc:cname="PRELIMNOISEALARMRNG" edc:nzwidth="0x1" edc:desc="Last preliminary noise alarm occurred due to history value out of range."/>
            <edc:SFRFieldDef edc:cname="PRELIMNOISEALARMREP" edc:nzwidth="0x1" edc:desc="Last preliminary noise alarm occurred due to consecutive high X**2."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
