Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_DATA_HWCONFIG" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF" edc:_addr="0x43014058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="NUMBOFRINGS" edc:nzwidth="0x8" edc:desc="Generic g_NumRings value."/>
            <edc:SFRFieldDef edc:cname="AIS31" edc:nzwidth="0x1" edc:desc="Generic g_AIS31 value."/>
            <edc:SFRFieldDef edc:cname="AIS31FULL" edc:nzwidth="0x1" edc:desc="Generic g_AIS31Full value."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:regionid="PBPIC_BRIDGE" edc:beginaddr="0x44000000" edc:endaddr="0x44013E64" edc:rw="rw">
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON0" edc:nzwidth="0x20" edc:access="-nnn-nnnnnnn-nn-nnnnnnnnnn-nnnn-" edc:por="01110001000000000000000000001011" edc:mclr="01110001000000000000000000001011" edc:impl="0x77F6FFDE" edc:_addr="0x44000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SWOEN" edc:nzwidth="0x1" edc:desc="SWO enable on 2-wire debug interface"/>
            <edc:SFRFieldDef edc:cname="TROEN" edc:nzwidth="0x1" edc:desc="Trace Output Enable"/>
            <edc:SFRFieldDef edc:cname="JTAGEN" edc:nzwidth="0x1" edc:desc="JTAG Enable"/>
            <edc:SFRFieldDef edc:cname="ADCPOVR" edc:nzwidth="0x1" edc:desc="ADC Charge Pump Override"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACCMP1_ALTEN" edc:nzwidth="0x1" edc:desc="AC CMP1 Alternate Enable"/>
            <edc:SFRFieldDef edc:cname="CPENFILT" edc:nzwidth="0x1" edc:desc="ADC CP Filter Enable"/>
            <edc:SFRFieldDef edc:cname="RTCIN0_ALTEN" edc:nzwidth="0x1" edc:desc="RTCIN0 Alternate Enable"/>
            <edc:SFRFieldDef edc:cname="RTCOUT_ALTEN" edc:nzwidth="0x1" edc:desc="RTCOUT Alternate Enable"/>
            <edc:SFRFieldDef edc:cname="PMULOCK" edc:nzwidth="0x1" edc:desc="PMU Controller Register LOCK"/>
            <edc:SFRFieldDef edc:cname="PGLCOK" edc:nzwidth="0x1" edc:desc="Permission Group LOCK"/>
            <edc:SFRFieldDef edc:cname="PMDLOCK" edc:nzwidth="0x1" edc:desc="Peripheral Module Disable (PMD) LOCK"/>
            <edc:SFRFieldDef edc:cname="IOLOCK" edc:nzwidth="0x1" edc:desc="IO LOCK"/>
            <edc:SFRFieldDef edc:cname="CFGCLOCK" edc:nzwidth="0x2" edc:desc="Configuration Register Lock"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBUSEN0" edc:nzwidth="0x1" edc:desc="SMBus Enable for SERCOM0"/>
            <edc:SFRFieldDef edc:cname="SMBUSEN1" edc:nzwidth="0x1" edc:desc="SMBus Enable for SERCOM1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HPLUGDIS" edc:nzwidth="0x1" edc:desc="Hot Plugging Disable"/>
            <edc:SFRFieldDef edc:cname="SLRTEN0" edc:nzwidth="0x1" edc:desc="SLRT Enable for SERCOM0"/>
            <edc:SFRFieldDef edc:cname="SLRTEN1" edc:nzwidth="0x1" edc:desc="SLRT Enable for SERCOM1"/>
            <edc:SFRFieldDef edc:cname="SLRTEN2" edc:nzwidth="0x1" edc:desc="SLRT Enable for SERCOM2"/>
            <edc:SFRFieldDef edc:cname="PCM" edc:nzwidth="0x1" edc:desc="PCHE I/D Cacheable Mode"/>
            <edc:SFRFieldDef edc:cname="INT0E" edc:nzwidth="0x1" edc:desc="INT0 Enable"/>
            <edc:SFRFieldDef edc:cname="INT0P" edc:nzwidth="0x1" edc:desc="INT0P Polarity"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FECCCON" edc:nzwidth="0x2" edc:desc="Flash ECC Control"/>
            <edc:SFRFieldDef edc:cname="FRECCDIS" edc:nzwidth="0x1" edc:desc="Flex RAM ECC Control"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON0CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000004"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON0SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000008"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON0INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400000C"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON1" edc:nzwidth="0x20" edc:access="-nnnnnnnnnnn-nnnnnnnn-nnnnn-----" edc:por="00011111000000000100000000111011" edc:mclr="00011111000000000100000000111011" edc:impl="0x7FF7FBE0" edc:_addr="0x44000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TRCEN" edc:nzwidth="0x1" edc:desc="Trace Enable"/>
            <edc:SFRFieldDef edc:cname="ECC_SEL_MEM" edc:nzwidth="0x1" edc:desc="ECC row selection bit"/>
            <edc:SFRFieldDef edc:cname="ZBTWKSYS" edc:nzwidth="0x1" edc:desc="ZBT Subsystem External Wake-up source"/>
            <edc:SFRFieldDef edc:cname="CMP0_OE" edc:nzwidth="0x1" edc:desc="Analog Comparator-0 Output Enable"/>
            <edc:SFRFieldDef edc:cname="CMP1_OE" edc:nzwidth="0x1" edc:desc="Analog Comparator-1 Output Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLRCTRL0" edc:nzwidth="0x1" edc:desc="I2C Slew Rate Control for SERCOM0"/>
            <edc:SFRFieldDef edc:cname="SLRCTRL1" edc:nzwidth="0x1" edc:desc="I2C Slew Rate Control for SERCOM1"/>
            <edc:SFRFieldDef edc:cname="SLRCTRL2" edc:nzwidth="0x1" edc:desc="I2C Slew Rate Control for SERCOM2"/>
            <edc:SFRFieldDef edc:cname="SMCLR" edc:nzwidth="0x1" edc:desc="Selects CRU handling of MCLR Control"/>
            <edc:SFRFieldDef edc:cname="QSCHE_EN" edc:nzwidth="0x1" edc:desc="QSPI Address Space Cache Attribute"/>
            <edc:SFRFieldDef edc:cname="QSPI_HSEN" edc:nzwidth="0x1" edc:desc="QSPI (Direct) Enable"/>
            <edc:SFRFieldDef edc:cname="SCOM0_HSEN" edc:nzwidth="0x1" edc:desc="SERCOM0 (Direct)High Speed Pin Enable"/>
            <edc:SFRFieldDef edc:cname="SCOM1_HSEN" edc:nzwidth="0x1" edc:desc="SERCOM1 (Direct)High Speed Pin Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_OE" edc:nzwidth="0x1" edc:desc="CCL Pads (via PPS) Output Enable"/>
            <edc:SFRFieldDef edc:cname="I2CDSEL0" edc:nzwidth="0x1" edc:desc="I2C Delay Select for SERCOM0"/>
            <edc:SFRFieldDef edc:cname="I2CDSEL1" edc:nzwidth="0x1" edc:desc="I2C Delay Select for SERCOM1"/>
            <edc:SFRFieldDef edc:cname="I2CDSEL2" edc:nzwidth="0x1" edc:desc="I2C Delay Select for SERCOM2"/>
            <edc:SFRFieldDef edc:cname="WDTPSS" edc:nzwidth="0x5" edc:desc="Watchdog Timer Post-scale Select Sleep"/>
            <edc:SFRFieldDef edc:cname="QSPIDDRM" edc:nzwidth="0x1" edc:desc="QSPI DDR Mode Clock Enable"/>
            <edc:SFRFieldDef edc:cname="CLKZBREF" edc:nzwidth="0x1" edc:desc="External Reference Clock ZB Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON1CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000014"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON1SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000018"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON1INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400001C"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn-nnnnnn" edc:por="01111111011111111111111100111000" edc:mclr="01111111011111111111111100111000" edc:impl="0xFFFFFFBF" edc:_addr="0x44000020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="ACMP_CYCLE" edc:nzwidth="0x3" edc:desc="AC SIB Comparator Result Wait Cycles"/>
            <edc:SFRFieldDef edc:cname="DMTINTV" edc:nzwidth="0x3" edc:desc="Dead Man Timer Count Window Interval"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PMUTEST_VDD_EN" edc:nzwidth="0x1" edc:desc="PMU Test Output or VDD/2 Enable via ADC IE12"/>
            <edc:SFRFieldDef edc:cname="POSCMOD" edc:nzwidth="0x2" edc:desc="Primary Oscillator Configuration"/>
            <edc:SFRFieldDef edc:cname="WDTRMCS" edc:nzwidth="0x2" edc:desc="WDT RUN Mode Clock Select"/>
            <edc:SFRFieldDef edc:cname="SOSCSEL" edc:nzwidth="0x1" edc:desc="SOSC Selection Configuration"/>
            <edc:SFRFieldDef edc:cname="WAKE2SPD" edc:nzwidth="0x1" edc:desc="2-Speed startup enabled in Sleep mode"/>
            <edc:SFRFieldDef edc:cname="CKSWEN" edc:nzwidth="0x1" edc:desc="Software Clock Switching Enable"/>
            <edc:SFRFieldDef edc:cname="FSCMEN" edc:nzwidth="0x1" edc:desc="Fail-Safe Clock Monitor Enable"/>
            <edc:SFRFieldDef edc:cname="WDTPSR" edc:nzwidth="0x5" edc:desc="Watchdog Timer Post-scale Select Run"/>
            <edc:SFRFieldDef edc:cname="WDTSPGM" edc:nzwidth="0x1" edc:desc="Watchdog Timer Stop during Flash Programming"/>
            <edc:SFRFieldDef edc:cname="WINDIS" edc:nzwidth="0x1" edc:desc="Windowed Watchdog Timer Disable"/>
            <edc:SFRFieldDef edc:cname="WDTEN" edc:nzwidth="0x1" edc:desc="Watchdog Timer Enable"/>
            <edc:SFRFieldDef edc:cname="WDTWINSZ" edc:nzwidth="0x2" edc:desc="Watchdog Timer Window Size"/>
            <edc:SFRFieldDef edc:cname="DMTCNT" edc:nzwidth="0x5" edc:desc="Dead Man Timer Count Select"/>
            <edc:SFRFieldDef edc:cname="DMTEN" edc:nzwidth="0x1" edc:desc="Dead Man Timer Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON2CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000024"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON2SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000028"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON2INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400002C"/>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x44000030"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="10000100000011100100000000000000" edc:mclr="10000100000011100100000000000000" edc:_addr="0x44000040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="SOSC_CFG" edc:nzwidth="0x8" edc:desc="SOSC Configuration"/>
            <edc:SFRFieldDef edc:cname="RTCEVENT_SEL" edc:nzwidth="0x2" edc:desc="RTC Event Selection"/>
            <edc:SFRFieldDef edc:cname="RTCEVENT_EN" edc:nzwidth="0x1" edc:desc="Pad Output Enable for MCHP legacy RTC event output"/>
            <edc:SFRFieldDef edc:cname="VBKP_1KCSEL" edc:nzwidth="0x1" edc:desc="VDDBUKPCORE LPCLK Clock Selection"/>
            <edc:SFRFieldDef edc:cname="VBKP_32KCSEL" edc:nzwidth="0x2" edc:desc="VDDBUKPCORE 32KHz clock source selection"/>
            <edc:SFRFieldDef edc:cname="VBKP_DIVSEL" edc:nzwidth="0x1" edc:desc="VDDBUKPCORE LPCLK Clock Divider Selection"/>
            <edc:SFRFieldDef edc:cname="LPCLK_MOD" edc:nzwidth="0x1" edc:desc="LPCLK modifier in counter/delay mode"/>
            <edc:SFRFieldDef edc:cname="RTCEVTYPE" edc:nzwidth="0x1" edc:desc="RTC Event Type"/>
            <edc:SFRFieldDef edc:cname="CPEN_DLY" edc:nzwidth="0x3" edc:desc="Charge-pump ready digital delay"/>
            <edc:SFRFieldDef edc:cname="DSZPBOREN" edc:nzwidth="0x1" edc:desc="Deep Sleep Zero-Power BOR Enable"/>
            <edc:SFRFieldDef edc:cname="DSWDTPS" edc:nzwidth="0x5" edc:desc="Deep Sleep Watchdog Timer Postscale Select"/>
            <edc:SFRFieldDef edc:cname="DSWDTOSC" edc:nzwidth="0x1" edc:desc="Deep Sleep Watchdog Timer Reference Clock Select"/>
            <edc:SFRFieldDef edc:cname="DSWDTEN" edc:nzwidth="0x1" edc:desc="Deep Sleep Watchdog Timer Enable"/>
            <edc:SFRFieldDef edc:cname="DSEN" edc:nzwidth="0x1" edc:desc="Deep Sleep Bit Enable"/>
            <edc:SFRFieldDef edc:cname="UVREGROVR" edc:nzwidth="0x1" edc:desc="ULPVREG Retention Mode Override"/>
            <edc:SFRFieldDef edc:cname="LPOSCEN" edc:nzwidth="0x1" edc:desc="Low Power (Secondary) Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="RTCNTM_CSEL" edc:nzwidth="0x1" edc:desc="RTC Counter Mode Clock Select"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON4CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000044"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON4SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000048"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGCON4INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400004C"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGPGQOS" edc:nzwidth="0x20" edc:access="nnnn--nnnnnnnnnn------nn----nnnn" edc:por="11100000010001000000000001001100" edc:mclr="11100000010001000000000001001100" edc:impl="0xF3FF030F" edc:_addr="0x44000050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="CPUPG" edc:nzwidth="0x2" edc:desc="CPU (Code) Permission Group"/>
            <edc:SFRFieldDef edc:cname="CPUQOS" edc:nzwidth="0x2" edc:desc="CPU I/D and System Bus QOS Control"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DMAPG" edc:nzwidth="0x2" edc:desc="DMA (Rd/Wr) Permission Group"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DGISPIPG" edc:nzwidth="0x2" edc:desc="ADC Controller Permission Group"/>
            <edc:SFRFieldDef edc:cname="DGISPIQOS" edc:nzwidth="0x2" edc:desc="ADC Controller QOS Control"/>
            <edc:SFRFieldDef edc:cname="CRYPTOPG" edc:nzwidth="0x2" edc:desc="Crypto Permission Group"/>
            <edc:SFRFieldDef edc:cname="CRYPTOQOS" edc:nzwidth="0x2" edc:desc="Crypto QOS Control"/>
            <edc:SFRFieldDef edc:cname="DSUPG" edc:nzwidth="0x2" edc:desc="DSU Permission Group"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FCQOS" edc:nzwidth="0x2" edc:desc="FC Controller QOS Control"/>
            <edc:SFRFieldDef edc:cname="WISIBQOS" edc:nzwidth="0x2" edc:desc="Wireless SIB QOS Control"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
