Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGPGQOSCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000054"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGPGQOSSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000058"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGPGQOSINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400005C"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="CFGPCLKGEN1" edc:nzwidth="0x20" edc:access="nnnn----nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0FFFFFF" edc:_addr="0x44000060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="EICCSEL" edc:nzwidth="0x3" edc:desc="EIC Clock Selection">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EICCD" edc:nzwidth="0x1" edc:desc="EIC Clock Disable">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FREQMRCSEL" edc:nzwidth="0x3" edc:desc="FREQMRC Clock Selection">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FREQMRCD" edc:nzwidth="0x1" edc:desc="FREQMRC Clock Disable">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FREQMMCSEL" edc:nzwidth="0x3" edc:desc="FREQMMC Clock Selection">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FREQMMCD" edc:nzwidth="0x1" edc:desc="FREQMMC Clock Disable">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SERCOM01CSEL" edc:nzwidth="0x3" edc:desc="SERCOM0/1 Clock Selection">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SERCOM01CD" edc:nzwidth="0x1" edc:desc="SERCOM0/1 Clock Disable">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SERCOM2CSEL" edc:nzwidth="0x3" edc:desc="SERCOM2/3 Clock Selection">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SERCOM2CD" edc:nzwidth="0x1" edc:desc="SERCOM2/3 Clock Disable">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TCC12CSEL" edc:nzwidth="0x3" edc:desc="TCC1/2 Clock Selection">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TCC12CD" edc:nzwidth="0x1" edc:desc="TCC1/2 Clock Disable">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CM4TCSEL" edc:nzwidth="0x3" edc:desc="CM4T Clock Selection">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CM4TCD" edc:nzwidth="0x1" edc:desc="CM4T Clock Disable">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
