Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x440000B4"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="PMD1" edc:nzwidth="0x20" edc:access="--n-----n------n------nnnn-nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x208103DF" edc:_addr="0x440000C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="ZBMD" edc:nzwidth="0x1" edc:desc="ZigBee Module Disable"/>
            <edc:SFRFieldDef edc:cname="BTMD" edc:nzwidth="0x1" edc:desc="Bluetooth Module Disable"/>
            <edc:SFRFieldDef edc:cname="MPAMD" edc:nzwidth="0x1" edc:desc="RF MPA Module Disable"/>
            <edc:SFRFieldDef edc:cname="LPAMD" edc:nzwidth="0x1" edc:desc="RF LPA Module Disable"/>
            <edc:SFRFieldDef edc:cname="PLVDMD" edc:nzwidth="0x1" edc:desc="PLVD Module Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACMD" edc:nzwidth="0x1" edc:desc="AC Module Disable"/>
            <edc:SFRFieldDef edc:cname="ADCMD" edc:nzwidth="0x1" edc:desc="ADC Controller Module Disable"/>
            <edc:SFRFieldDef edc:cname="ADCSARMD" edc:nzwidth="0x1" edc:desc="Shared ADC SAR Core Module Disable"/>
            <edc:SFRFieldDef edc:cname="CVDMD" edc:nzwidth="0x1" edc:desc="Shared ADC SAR Core Module Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RTCCMD" edc:nzwidth="0x1" edc:desc="RTCC Module Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DGISPIMD" edc:nzwidth="0x1" edc:desc="DGI SPI Module Disable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="QSPIMD" edc:nzwidth="0x1" edc:desc="SQI Module Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="PMD1CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440000C4"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="PMD1SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440000C8"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="PMD1INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440000CC"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="PMD2" edc:nzwidth="0x20" edc:access="nnnn--nn------------------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF3000000" edc:_addr="0x440000D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="REFO5MD" edc:nzwidth="0x1" edc:desc="Reference (Clock) Out 5 Module Disable"/>
            <edc:SFRFieldDef edc:cname="REFO6MD" edc:nzwidth="0x1" edc:desc="Reference (Clock) Out 6 Module Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="REFO1MD" edc:nzwidth="0x1" edc:desc="Reference (Clock) Out 1 Module Disable"/>
            <edc:SFRFieldDef edc:cname="REFO2MD" edc:nzwidth="0x1" edc:desc="Reference (Clock) Out 2 Module Disable"/>
            <edc:SFRFieldDef edc:cname="REFO3MD" edc:nzwidth="0x1" edc:desc="Reference (Clock) Out 3 Module Disable"/>
            <edc:SFRFieldDef edc:cname="REFO4MD" edc:nzwidth="0x1" edc:desc="Reference (Clock) Out 4 Module Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="PMD2CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440000D4"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="PMD2SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440000D8"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="PMD2INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440000DC"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="PMD3" edc:nzwidth="0x20" edc:access="-----------------nnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF" edc:_addr="0x440000E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="SER0MD" edc:nzwidth="0x1" edc:desc="SERCOM0 Module Disable"/>
            <edc:SFRFieldDef edc:cname="SER1MD" edc:nzwidth="0x1" edc:desc="SERCOM1 Module Disable"/>
            <edc:SFRFieldDef edc:cname="SER2MD" edc:nzwidth="0x1" edc:desc="SERCOM2 Module Disable"/>
            <edc:SFRFieldDef edc:cname="DACMD" edc:nzwidth="0x1" edc:desc="DAC Module Disable"/>
            <edc:SFRFieldDef edc:cname="TC0MD" edc:nzwidth="0x1" edc:desc="TC0 Module Disable"/>
            <edc:SFRFieldDef edc:cname="TC1MD" edc:nzwidth="0x1" edc:desc="TC1 Module Disable"/>
            <edc:SFRFieldDef edc:cname="TC2MD" edc:nzwidth="0x1" edc:desc="TC2 Module Disable"/>
            <edc:SFRFieldDef edc:cname="TC3MD" edc:nzwidth="0x1" edc:desc="TC3 Module Disable"/>
            <edc:SFRFieldDef edc:cname="TC4MD" edc:nzwidth="0x1" edc:desc="TC4 Module Disable"/>
            <edc:SFRFieldDef edc:cname="TC5MD" edc:nzwidth="0x1" edc:desc="TC5 Module Disable"/>
            <edc:SFRFieldDef edc:cname="TC6MD" edc:nzwidth="0x1" edc:desc="TC6 Module Disable"/>
            <edc:SFRFieldDef edc:cname="TC7MD" edc:nzwidth="0x1" edc:desc="TC7 Module Disable"/>
            <edc:SFRFieldDef edc:cname="TCC0MD" edc:nzwidth="0x1" edc:desc="TCC0 Module Disable"/>
            <edc:SFRFieldDef edc:cname="TCC1MD" edc:nzwidth="0x1" edc:desc="TCC1 Module Disable"/>
            <edc:SFRFieldDef edc:cname="TCC2MD" edc:nzwidth="0x1" edc:desc="TCC2 Module Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="PMD3CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440000E4"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="PMD3SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440000E8"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="PMD3INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440000EC"/>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x440000F0"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="MISCSTAT" edc:nzwidth="0x20" edc:access="----------------------n---------" edc:por="00000001000000000000000010000001" edc:mclr="00000001000000000000000010000001" edc:impl="0x200" edc:_addr="0x44000100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CLDORDY" edc:nzwidth="0x1" edc:desc="CLDO Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3C" edc:_addr="0x44000104"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="ID" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000140"/>
      <edc:AdjustPoint edc:offset="0xBC" edc:_addr="0x44000144"/>
      <edc:SFRDef ltx:memberofperipheral="CFG" edc:cname="BCFG0" edc:nzwidth="0x20" edc:access="r-rr--------------------------r-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xB0000002" edc:_addr="0x44000200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PCSCMODE" edc:nzwidth="0x1" edc:desc="PCHE Single cache Mode"/>
            <edc:AdjustPoint edc:offset="0x1A"/>
            <edc:SFRFieldDef edc:cname="CP" edc:nzwidth="0x1" edc:desc="Boot Code Protect"/>
            <edc:SFRFieldDef edc:cname="SIGN" edc:nzwidth="0x1" edc:desc="Flash SIGN"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BINFOVALID0" edc:nzwidth="0x1" edc:desc="First 256-bit BCFG information Valid"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
