Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:AdjustPoint edc:offset="0x2FC" edc:_addr="0x44000204"/>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDTCON" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnn--nnnnnnnnnnnnn" edc:impl="0xFFFF9FFF" edc:_addr="0x44000500">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="WDTWINEN" edc:nzwidth="0x1" edc:desc="Watchdog Timer Window Enable bit">
              <edc:SFRFieldSemantic edc:cname="WDTWINEN" edc:desc="Enable windowed Watchdog Timer" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="WDTWINDIS" edc:desc="Disable windowed Watchdog Timer" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLPDIV" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNDIV" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1" edc:desc="Watchdog Timer Enable bit">
              <edc:SFRFieldSemantic edc:cname="WDTEN" edc:desc="The WDT module is enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="WDTOFF" edc:desc="The WDT module is disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WDTCLRKEY" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDTCONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000504"/>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDTCONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000508"/>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="WDTCONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400050C"/>
      <edc:AdjustPoint edc:offset="0xF0" edc:_addr="0x44000510"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMCON" edc:nzwidth="0x20" edc:access="----------------nnnn--------nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF00F" edc:_addr="0x44000600">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="NVMOP" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="LVDERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMCONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000604"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMCONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000608"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMCONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400060C"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMCON2" edc:nzwidth="0x20" edc:access="nnnn---n---nnnnn-nnn--nn-------n" edc:por="00000001000111110100000000000000" edc:mclr="00000001000111110100000000000000" edc:impl="0xF11F7301" edc:_addr="0x44000610">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="NVMPREPG" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RETRY" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREAD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CREAD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEMP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SLEEP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ERS" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMCON2CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000614"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMCON2SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000618"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMCON2INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400061C"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMKEY" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000620">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="NVMKEY" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000624"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000630">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="NVMADDR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000634"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMDATA0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000640">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="NVMDATA0" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000644"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMDATA1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000650">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="NVMDATA1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000654"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMDATA2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000660">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="NVMDATA2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000664"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMDATA3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000670">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="NVMDATA3" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4C" edc:_addr="0x44000674"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMSRCADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440006C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="NVMSRCADDR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x440006C4"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMPWPLT" edc:nzwidth="0x20" edc:access="n-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x80FFFFFF" edc:_addr="0x440006D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="PWPLT" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMPWPLTCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440006D4"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMPWPLTSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440006D8"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMPWPLTINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440006DC"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMPWPGTE" edc:nzwidth="0x20" edc:access="n-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="10000000111111111111111111111111" edc:mclr="10000000111111111111111111111111" edc:impl="0x80FFFFFF" edc:_addr="0x440006E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="PWPGTE" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMPWPGTECLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440006E4"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMPWPGTESET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440006E8"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMPWPGTEINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440006EC"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMLBWP" edc:nzwidth="0x20" edc:access="n-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="10000000111111111111111111111111" edc:mclr="10000000111111111111111111111111" edc:impl="0x80FFFFFF" edc:_addr="0x440006F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="LBWP0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP23" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
