Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMLBWPCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440006F4"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMLBWPSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440006F8"/>
      <edc:SFRDef ltx:memberofperipheral="NVM" edc:cname="NVMLBWPINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440006FC"/>
      <edc:AdjustPoint edc:offset="0x100" edc:_addr="0x44000700"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_CON" edc:nzwidth="0x20" edc:access="----------------nnn-------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xE000" edc:_addr="0x44000800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000804"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_CRCCON" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnn---------nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFF007" edc:_addr="0x44000810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="AUTOR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBITO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PAUSE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="PLEN32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERIOD" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000814"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_CRCMADR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="IFT_CRCMADR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000824"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_CRCMLEN" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x44000830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="CRCMLEN" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000834"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_CRCIV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000840">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="CRCIV" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000844"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_CRCACC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000850">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="CRCACC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000854"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_CRCPOLY" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000860">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="CYCPOLY" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000864"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_CRCFXOR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000870">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="CRCFXOR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000874"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_CRCSUM" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000880">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="CRCSUM" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000884"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_ECCCON" edc:nzwidth="0x20" edc:access="----------------n----nnnn----nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x8787" edc:_addr="0x44000890">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="FLT_MD" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="EVENT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTLFLT" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FLTEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000894"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_ECCFLT" edc:nzwidth="0x20" edc:access="-------nnnnnnnnn-------nnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FF01FF" edc:_addr="0x440008A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="FLT1PTR" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="FLT2PTR" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x440008A4"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_ECCADR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440008B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="ECCADR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x440008B4"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_ECCPAR" edc:nzwidth="0x20" edc:access="n------nnnnnnnnnn------nnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x81FF81FF" edc:_addr="0x440008C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="SECIN" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DEDIN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SECOUT" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DEDOUT" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x440008C4"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="IFT_ECCSYN" edc:nzwidth="0x20" edc:access="nnnn-nnn-----nnnn------nnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF70781FF" edc:_addr="0x440008D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="SECSYN" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DEDSYS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CERR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CTLSTAT" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
