Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="SPLLCONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A24"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="SPLLCONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A28"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="SPLLCONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A2C"/>
      <edc:SFRDef ltx:memberofperipheral="RCON" edc:cname="RCON" edc:nzwidth="0x20" edc:access="nn--nnnn-------------nn-nnnnnnnn" edc:por="00000000000000000000000000000011" edc:mclr="00000000000000000000000000000011" edc:impl="0xCF0006FF" edc:_addr="0x44000A30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RCON">
            <edc:SFRFieldDef edc:cname="POR" edc:nzwidth="0x1" edc:desc="Power-On Reset Flag bit">
              <edc:SFRFieldSemantic edc:cname="POR" edc:desc="A Power-up Reset has occurred." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_POR" edc:desc="A Power-up Reset has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BOR" edc:nzwidth="0x1" edc:desc="Brown-out Reset Flag bit">
              <edc:SFRFieldSemantic edc:cname="BOR" edc:desc="A Brown-out Reset has occurred." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_BOR" edc:desc="A Brown-out Reset has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IDLE" edc:nzwidth="0x1" edc:desc="Wake from Idle Flag bit">
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Device was in Idle mode." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_IDLE" edc:desc="Device was not in Idle mode." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLEEP" edc:nzwidth="0x1" edc:desc="Wake from Sleep Flag bit">
              <edc:SFRFieldSemantic edc:cname="SLEEP" edc:desc="Device has been in Sleep mode." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_SLEEP" edc:desc="Device has not been in Sleep mode." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WDTO" edc:nzwidth="0x1" edc:desc="Watchdog Timer Time-Out Flag bit">
              <edc:SFRFieldSemantic edc:cname="WDTO" edc:desc="WDT Time-out has occurred and caused a reset." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_WDTO" edc:desc="WDT Time-out has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMTO" edc:nzwidth="0x1" edc:desc="Deadman Timer Time-Out Flag bit">
              <edc:SFRFieldSemantic edc:cname="DMTO" edc:desc="DMT Time-out has occurred and caused a reset." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_DMTO" edc:desc="DMT Time-out has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SWR" edc:nzwidth="0x1" edc:desc="Software Reset Flag bit">
              <edc:SFRFieldSemantic edc:cname="SWR" edc:desc="A Software Commanded Reset has occurred." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_SWR" edc:desc="A Software Commanded Reset has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EXTR" edc:nzwidth="0x1" edc:desc="External Reset (MCLR) Status bit">
              <edc:SFRFieldSemantic edc:cname="EXTR" edc:desc="A Master Clear (pin) Reset has occurred." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_EXTR" edc:desc="A Master Clear (pin) Reset has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMR" edc:nzwidth="0x1" edc:desc="Configuration Mismatch Flag bit">
              <edc:SFRFieldSemantic edc:cname="CMR" edc:desc="A Configuration Mismatch Reset Event has occurred." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_CMR" edc:desc="A Configuration Mismatch Reset Event has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DPSLP" edc:nzwidth="0x1" edc:desc="DPSLP Deep Sleep Mode Flag Bit">
              <edc:SFRFieldSemantic edc:cname="DSLP" edc:desc="Deep Sleep Mode has occurred." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_DSLP" edc:desc="Deep Sleep Mode has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="NVMEOL" edc:nzwidth="0x1" edc:desc="NVM End of Life Flag Bit">
              <edc:SFRFieldSemantic edc:cname="NO_NVMEOL" edc:desc="A NVM EOL Failure has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="NVMEOL" edc:desc="A NVM EOL Failure has occurred." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NVMLTA" edc:nzwidth="0x1" edc:desc="NVM Life Time Alert Flag Bit">
              <edc:SFRFieldSemantic edc:cname="NO_NVMLTA" edc:desc="A NVM LTA Error has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="NVMLTA" edc:desc="A NVM LTA Error has occurred." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BCFGFAIL" edc:nzwidth="0x1" edc:desc="BCFG Failure Flag Bit">
              <edc:SFRFieldSemantic edc:cname="NO_BCFGFAIL" edc:desc="A BCFG Failure has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BCFGFAIL" edc:desc="A BCFG Failure has occurred." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BCFGERR" edc:nzwidth="0x1" edc:desc="BCFG Error Flag Bit">
              <edc:SFRFieldSemantic edc:cname="NO_BCFGERR" edc:desc="A BCFG Error has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BCFGERR" edc:desc="A BCFG Error has occurred." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PORCORE" edc:nzwidth="0x1" edc:desc="Core Voltage POR Flag bit">
              <edc:SFRFieldSemantic edc:cname="PORCORE" edc:desc="A Power-up Reset has occurred due to Core Voltage." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_PORCORE" edc:desc="A Power-up Reset has not occurred due to Core Voltage." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PORIO" edc:nzwidth="0x1" edc:desc="IO Voltage POR Flag bit">
              <edc:SFRFieldSemantic edc:cname="PORIO" edc:desc="A Power-up Reset has occurred due to IO Voltage." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_PORIO" edc:desc="A Power-up Reset has not occurred due to IO Voltage." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RCON" edc:cname="RCONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A34"/>
      <edc:SFRDef ltx:memberofperipheral="RCON" edc:cname="RCONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A38"/>
      <edc:SFRDef ltx:memberofperipheral="RCON" edc:cname="RCONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A3C"/>
      <edc:SFRDef ltx:memberofperipheral="RCON" edc:cname="RSWRST" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x44000A40">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RCON">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Trigger">
              <edc:SFRFieldSemantic edc:cname="SWRST" edc:desc="Enable software reset event" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_SWRST" edc:desc="Do not enable software reset event" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RCON" edc:cname="RSWRSTCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A44"/>
      <edc:SFRDef ltx:memberofperipheral="RCON" edc:cname="RSWRSTSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A48"/>
      <edc:SFRDef ltx:memberofperipheral="RCON" edc:cname="RSWRSTINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A4C"/>
      <edc:SFRDef ltx:memberofperipheral="RCON" edc:cname="RNMICON" edc:nzwidth="0x20" edc:access="------nnn---nnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x38FFFFF" edc:_addr="0x44000A50">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RCON">
            <edc:SFRFieldDef edc:cname="NMICNT" edc:nzwidth="0x10" edc:desc="NMI Reset counter value">
              <edc:SFRFieldSemantic edc:cname="NODLY" edc:desc="No delay between NMI assertion and device reset event" edc:when="(field &amp; 0xFFFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="1CLKDLY" edc:desc="1 sys_clk cycle that Software has to clear the NMI event before a device reset is performed." edc:when="(field &amp; 0xFFFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="2CLKDLY" edc:desc="2 sys_clk cycles that Software has to clear the NMI event before a device reset is performed." edc:when="(field &amp; 0xFFFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="64KCLKDLY" edc:desc="65535 sys_clk cycles that Software has to clear the NMI event before a device reset is performed." edc:when="(field &amp; 0xFFFF) == 0xFFFF"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WDTS" edc:nzwidth="0x1" edc:desc="Watch-Dog Timer Time-Out in Sleep Flag bit">
              <edc:SFRFieldSemantic edc:cname="WDTS" edc:desc="WDT Time-out has occurred during sleep_mode and caused a wake-up from sleep." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_WDTS" edc:desc="WDT Time-out has not occurred during sleep_mode." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CF" edc:nzwidth="0x1" edc:desc="Clock Fail Detect bit">
              <edc:SFRFieldSemantic edc:cname="CFAIL" edc:desc="FSCM has detected clock failure and caused an NMI" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_FAILDET" edc:desc="FSCM has not detected clock failure" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LVD" edc:nzwidth="0x1" edc:desc="Programmable Low Voltage Detect Event">
              <edc:SFRFieldSemantic edc:cname="LVD" edc:desc="PLVD has detected a low voltage condition and caused an NMI" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_LVD" edc:desc="PLVD has not detected a low voltage condition" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="GNMI" edc:nzwidth="0x1" edc:desc="External / Generic NMI Event">
              <edc:SFRFieldSemantic edc:cname="NMI" edc:desc="A general NMI event has been detected and caused an NMI" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_NMI" edc:desc="A general NMI event has not been detected." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SWNMI" edc:nzwidth="0x1" edc:desc="Software NMI Trigger">
              <edc:SFRFieldSemantic edc:cname="SWNMI" edc:desc="Writing a 1 to this bit will cause an NMI to be generated" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_SWNMI" edc:desc="Writing a 0 to this bit will have no effect." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WDTR" edc:nzwidth="0x1" edc:desc="Watchdog Timer Time-Out in Run Flag bit">
              <edc:SFRFieldSemantic edc:cname="WDTR" edc:desc="WDT Time-out has occurred and caused a NMI." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_WDTR" edc:desc="WDT Time-out has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMTO" edc:nzwidth="0x1" edc:desc="Deadman Timer Time-Out Flag bit">
              <edc:SFRFieldSemantic edc:cname="DMTO" edc:desc="DMT Time-out has occurred and caused a NMI." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_DMTO" edc:desc="DMT Time-out has not occurred." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RCON" edc:cname="RNMICONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A54"/>
      <edc:SFRDef ltx:memberofperipheral="RCON" edc:cname="RNMICONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A58"/>
      <edc:SFRDef ltx:memberofperipheral="RCON" edc:cname="RNMICONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A5C"/>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x44000A60"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO1CON" edc:nzwidth="0x20" edc:access="-nnnnnnnnnnnnnnnnnnnn-nn----nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFFFB0F" edc:_addr="0x44000A70">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:nzwidth="0x4" edc:desc="Reference Clock Source Select bits">
              <edc:SFRFieldSemantic edc:cname="REFCLKI" edc:desc="REFI Pin" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="SYSCLK" edc:desc="System clock (reference clock reflects any device clock switching)" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="PBCLK1" edc:desc="Peripheral clock 1 (reference clock reflects any peripheral clock switching)" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="SPLL3" edc:desc="System PLL3 (Clock-3)" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="LPRC" edc:desc="LPRC" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SOSC" edc:desc="SOSC" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="POSC" edc:desc="POSC" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SPLL1" edc:desc="System PLL1 (Clock-1)" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="FRC" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:nzwidth="0x1" edc:desc="Reference Clock Request Status bit">
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="Reference clock request is active (User should not update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_ACTIVE" edc:desc="Reference clock request is not active (User can update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:nzwidth="0x1" edc:desc="Clock RODIV/ROTRIM switch enabled.">
              <edc:SFRFieldSemantic edc:cname="SWINPROGRESS" edc:desc="Clock Divider Switching currently in progress." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SWCOMPLETE" edc:desc="Clock Divider Switch has completed." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:nzwidth="0x1" edc:desc="Reference Oscillator Run in Sleep bit">
              <edc:SFRFieldSemantic edc:cname="RSLP" edc:desc="Reference Oscillator output continues to run in Sleep" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_RSLP" edc:desc="Reference Oscillator output is disabled in Sleep" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OE" edc:nzwidth="0x1" edc:desc="Reference Clock Output Enable bit">
              <edc:SFRFieldSemantic edc:cname="REFO1_OE" edc:desc="Reference clock is driven out on REFO1 pin" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_REFO1_OE" edc:desc="Reference clock is not driven out on REFO1 pin." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1" edc:desc="Peripheral Stop in Idle Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIDL" edc:desc="Discontinue module operation when device enters Idle mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_SIDL" edc:desc="Continue module operation in Idle mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Freeze in Debug mode bit">
              <edc:SFRFieldSemantic edc:cname="FRZ" edc:desc="When emulator is in Debug mode, module freezes operation" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_FRZ" edc:desc="When emulator is in Debug mode, module continues operation" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1" edc:desc="Output Enable bit">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Reference Oscillator Module enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Reference Oscillator Module disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RODIV" edc:nzwidth="0xF" edc:desc="Reference Clock Divider bits">
              <edc:SFRFieldSemantic edc:cname="65K" edc:desc="REFO1 clock is Base clock frequency divided by 65,534 (32,767 *2)" edc:when="(field &amp; 0x7FFF) == 0x7FFF"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="REFO1 clock is Base clock frequency divided by 4 (2*2)" edc:when="(field &amp; 0x7FFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="REFO1 clock is Base clock frequency divided by 2 (1*2)" edc:when="(field &amp; 0x7FFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="REFO1 clock is same frequency as Base clock (no divider)" edc:when="(field &amp; 0x7FFF) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
