Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO1CONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A74"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO1CONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A78"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO1CONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A7C"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO1TRIM" edc:nzwidth="0x20" edc:access="nnnnnnnnn-----------------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF800000" edc:_addr="0x44000A80">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:nzwidth="0x9" edc:desc="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="0/512 (0.0) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ONE" edc:desc="1/512 (0.001953125) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="TWO" edc:desc="2/512 (0.00390625) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TRIM_256" edc:desc="256/512 (0.5000) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x100"/>
              <edc:SFRFieldSemantic edc:cname="TRIM_512" edc:desc="511/512 (0.998046875) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x1FF"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO1TRIMCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A84"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO1TRIMSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A88"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO1TRIMINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A8C"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO2CON" edc:nzwidth="0x20" edc:access="-nnnnnnnnnnnnnnnnnnnn-nn----nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFFFB0F" edc:_addr="0x44000A90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:nzwidth="0x4" edc:desc="Reference Clock Source Select bits">
              <edc:SFRFieldSemantic edc:cname="REFCLKI" edc:desc="REFI Pin" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="SYSCLK" edc:desc="System clock (reference clock reflects any device clock switching)" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="PBCLK1" edc:desc="Peripheral clock 1 (reference clock reflects any peripheral clock switching)" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="SPLL3" edc:desc="System PLL3 (Clock-3)" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="LPRC" edc:desc="LPRC" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SOSC" edc:desc="SOSC" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="POSC" edc:desc="POSC" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SPLL1" edc:desc="System PLL1 (Clock-1)" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="FRC" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:nzwidth="0x1" edc:desc="Reference Clock Request Status bit">
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="Reference clock request is active (User should not update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_ACTIVE" edc:desc="Reference clock request is not active (User can update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:nzwidth="0x1" edc:desc="Clock RODIV/ROTRIM switch enabled.">
              <edc:SFRFieldSemantic edc:cname="SWINPROGRESS" edc:desc="Clock Divider Switching currently in progress." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SWCOMPLETE" edc:desc="Clock Divider Switch has completed." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:nzwidth="0x1" edc:desc="Reference Oscillator Run in Sleep bit">
              <edc:SFRFieldSemantic edc:cname="RSLP" edc:desc="Reference Oscillator output continues to run in Sleep" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_RSLP" edc:desc="Reference Oscillator output is disabled in Sleep" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OE" edc:nzwidth="0x1" edc:desc="Reference Clock Output Enable bit">
              <edc:SFRFieldSemantic edc:cname="REFO2_OE" edc:desc="Reference clock is driven out on REFO2 pin" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_REFO2_OE" edc:desc="Reference clock is not driven out on REFO2 pin." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1" edc:desc="Peripheral Stop in Idle Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIDL" edc:desc="Discontinue module operation when device enters Idle mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_SIDL" edc:desc="Continue module operation in Idle mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Freeze in Debug mode bit">
              <edc:SFRFieldSemantic edc:cname="FRZ" edc:desc="When emulator is in Debug mode, module freezes operation" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_FRZ" edc:desc="When emulator is in Debug mode, module continues operation" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1" edc:desc="Output Enable bit">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Reference Oscillator Module enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Reference Oscillator Module disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RODIV" edc:nzwidth="0xF" edc:desc="Reference Clock Divider bits">
              <edc:SFRFieldSemantic edc:cname="65K" edc:desc="REFO2 clock is Base clock frequency divided by 65,534 (32,767 *2)" edc:when="(field &amp; 0x7FFF) == 0x7FFF"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="REFO2 clock is Base clock frequency divided by 4 (2*2)" edc:when="(field &amp; 0x7FFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="REFO2 clock is Base clock frequency divided by 2 (1*2)" edc:when="(field &amp; 0x7FFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="REFO2 clock is same frequency as Base clock (no divider)" edc:when="(field &amp; 0x7FFF) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO2CONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A94"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO2CONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A98"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO2CONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A9C"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO2TRIM" edc:nzwidth="0x20" edc:access="nnnnnnnnn-----------------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF800000" edc:_addr="0x44000AA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:nzwidth="0x9" edc:desc="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="0/512 (0.0) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ONE" edc:desc="1/512 (0.001953125) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="TWO" edc:desc="2/512 (0.00390625) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TRIM_256" edc:desc="256/512 (0.5000) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x100"/>
              <edc:SFRFieldSemantic edc:cname="TRIM_512" edc:desc="511/512 (0.998046875) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x1FF"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO2TRIMCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000AA4"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO2TRIMSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000AA8"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO2TRIMINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000AAC"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO3CON" edc:nzwidth="0x20" edc:access="-nnnnnnnnnnnnnnnnnnnn-nn----nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFFFB0F" edc:_addr="0x44000AB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:nzwidth="0x4" edc:desc="Reference Clock Source Select bits">
              <edc:SFRFieldSemantic edc:cname="REFCLKI" edc:desc="REFI Pin" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="SYSCLK" edc:desc="System clock (reference clock reflects any device clock switching)" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="PBCLK1" edc:desc="Peripheral clock 1 (reference clock reflects any peripheral clock switching)" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="SPLL3" edc:desc="System PLL3 (Clock-3)" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="LPRC" edc:desc="LPRC" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SOSC" edc:desc="SOSC" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="POSC" edc:desc="POSC" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SPLL1" edc:desc="System PLL1 (Clock-1)" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="FRC" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:nzwidth="0x1" edc:desc="Reference Clock Request Status bit">
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="Reference clock request is active (User should not update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_ACTIVE" edc:desc="Reference clock request is not active (User can update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:nzwidth="0x1" edc:desc="Clock RODIV/ROTRIM switch enabled.">
              <edc:SFRFieldSemantic edc:cname="SWINPROGRESS" edc:desc="Clock Divider Switching currently in progress." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SWCOMPLETE" edc:desc="Clock Divider Switch has completed." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:nzwidth="0x1" edc:desc="Reference Oscillator Run in Sleep bit">
              <edc:SFRFieldSemantic edc:cname="RSLP" edc:desc="Reference Oscillator output continues to run in Sleep" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_RSLP" edc:desc="Reference Oscillator output is disabled in Sleep" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OE" edc:nzwidth="0x1" edc:desc="Reference Clock Output Enable bit">
              <edc:SFRFieldSemantic edc:cname="REFO3_OE" edc:desc="Reference clock is driven out on REFO3 pin" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_REFO3_OE" edc:desc="Reference clock is not driven out on REFO3 pin." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1" edc:desc="Peripheral Stop in Idle Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIDL" edc:desc="Discontinue module operation when device enters Idle mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_SIDL" edc:desc="Continue module operation in Idle mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Freeze in Debug mode bit">
              <edc:SFRFieldSemantic edc:cname="FRZ" edc:desc="When emulator is in Debug mode, module freezes operation" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_FRZ" edc:desc="When emulator is in Debug mode, module continues operation" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1" edc:desc="Output Enable bit">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Reference Oscillator Module enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Reference Oscillator Module disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RODIV" edc:nzwidth="0xF" edc:desc="Reference Clock Divider bits">
              <edc:SFRFieldSemantic edc:cname="65K" edc:desc="REFO3 clock is Base clock frequency divided by 65,534 (32,767 *2)" edc:when="(field &amp; 0x7FFF) == 0x7FFF"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="REFO3 clock is Base clock frequency divided by 4 (2*2)" edc:when="(field &amp; 0x7FFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="REFO3 clock is Base clock frequency divided by 2 (1*2)" edc:when="(field &amp; 0x7FFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="REFO3 clock is same frequency as Base clock (no divider)" edc:when="(field &amp; 0x7FFF) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
