Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="PB3DIVCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B54"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="PB3DIVSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B58"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="PB3DIVINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B5C"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="SLEWCON" edc:nzwidth="0x20" edc:access="----nnnn----nnnn-----nnn-----nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0F0707" edc:_addr="0x44000B60">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="Clock Switch Slewing Active Status Bit - Read-Only">
              <edc:SFRFieldSemantic edc:cname="FINAL" edc:desc="Clock Switch has reached its final value" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BUSY" edc:desc="Clock frequency is being actively Slewed" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DNEN" edc:nzwidth="0x1" edc:desc="Clock slew enable for switching down to slower clocks">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Clock Slewing disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Clock Slewing enabled on a clock switch" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UPEN" edc:nzwidth="0x1" edc:desc="Clock slew enable for switching up to faster clocks">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Clock Slewing disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Clock Slewing enabled on a clock switch OR exit from SLEEP" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SLWDIV" edc:nzwidth="0x3" edc:desc="Divisor steps used when doing slewed clock switches">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Divisor used" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="Divide by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="4to2" edc:desc="Divide by 4, then by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="8to2" edc:desc="Divide by 8, then by 4, then by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="16to2" edc:desc="Divide by 16, then by 8, then by 4, then by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="32to2" edc:desc="Divide by 32, then by 16, then by 8, then by 4, then by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="64to2" edc:desc="Divide by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="128to2" edc:desc="Divide by 128, then by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SYSDIV" edc:nzwidth="0x4" edc:desc="PBx Peripheral Clock Divisor Control value">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide by 1- sys_clk_out same frequency as sys_clk source - Default" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2- sys_clk_out is 1/2 of sys_clk source" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV3" edc:desc="Divide by 3- sys_clk_out is 1/3 of sys_clk source" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide by 4- sys_clk_out is 1/4 of sys_clk source" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV5" edc:desc="Divide by 5- sys_clk_out is 1/5 of sys_clk source" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV6" edc:desc="Divide by 6- sys_clk_out is 1/6 of sys_clk source" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV7" edc:desc="Divide by 7- sys_clk_out is 1/7 of sys_clk source" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide by 8- sys_clk_out is 1/8 of sys_clk source" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="DIV9" edc:desc="Divide by 9- sys_clk_out is 1/9 of sys_clk source" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="DIV10" edc:desc="Divide by 10- sys_clk_out is 1/10 of sys_clk source" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="DIV11" edc:desc="Divide by 11- sys_clk_out is 1/11 of sys_clk source" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="DIV12" edc:desc="Divide by 12- sys_clk_out is 1/12 of sys_clk source" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="DIV13" edc:desc="Divide by 13- sys_clk_out is 1/13 of sys_clk source" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="DIV14" edc:desc="Divide by 14- sys_clk_out is 1/14 of sys_clk source" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="DIV15" edc:desc="Divide by 15- sys_clk_out is 1/15 of sys_clk source" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16- sys_clk_out is 1/16 of sys_clk source" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SLWDLY" edc:nzwidth="0x4" edc:desc="Number of clocks generated at each slew step for a clock switch">
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="1 clock will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="2 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="3" edc:desc="3 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="4 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="5" edc:desc="5 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="6" edc:desc="6 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="7" edc:desc="7 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="9" edc:desc="9 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="10" edc:desc="10 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="11" edc:desc="11 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="12" edc:desc="12 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="13" edc:desc="13 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="14" edc:desc="14 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="15" edc:desc="15 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
