Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="PPS" edc:cname="RPB1G3R" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F" edc:_addr="0x44001298">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="RPB1G3R" edc:nzwidth="0x5" edc:desc="RPB1/G3">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P0" edc:desc="SERCOM0/PAD0" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P3" edc:desc="SERCOM0/PAD3" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P2" edc:desc="SERCOM1/PAD2" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P3" edc:desc="SERCOM1/PAD3" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO2" edc:desc="TCC0/WO2" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO0" edc:desc="TCC0/WO0" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO4" edc:desc="TCC0/WO4" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO2" edc:desc="TCC1/WO2" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO0" edc:desc="TCC1/WO0" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO4" edc:desc="TCC1/WO4" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="TCC2WO0" edc:desc="TCC2/WO0" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="TC0WO0" edc:desc="TC0/WO0" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="TC1WO0" edc:desc="TC1/WO0" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="TC2WO0" edc:desc="TC2/WO0" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="TC3WO0" edc:desc="TC3/WO0" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="TC4WO0" edc:desc="TC4/WO0" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="TC5WO0" edc:desc="TC5/WO0" edc:when="(field &amp; 0x1F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="TC6WO0" edc:desc="TC6/WO0" edc:when="(field &amp; 0x1F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="TC7WO0" edc:desc="TC7/WO0" edc:when="(field &amp; 0x1F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="QCS" edc:desc="QCS" edc:when="(field &amp; 0x1F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="QD1" edc:desc="QD1" edc:when="(field &amp; 0x1F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="QD0" edc:desc="QD0" edc:when="(field &amp; 0x1F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="QD3" edc:desc="QD3" edc:when="(field &amp; 0x1F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="CCLOUT0" edc:desc="CCLOUT0" edc:when="(field &amp; 0x1F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS1" edc:desc="TSTBUS1" edc:when="(field &amp; 0x1F) == 0x1C"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS4" edc:desc="TSTBUS4" edc:when="(field &amp; 0x1F) == 0x1D"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS7" edc:desc="TSTBUS7" edc:when="(field &amp; 0x1F) == 0x1E"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS10" edc:desc="TSTBUS10" edc:when="(field &amp; 0x1F) == 0x1F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PPS" edc:cname="RPB2G3R" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F" edc:_addr="0x4400129C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="RPB2G3R" edc:nzwidth="0x5" edc:desc="RPB2/G3">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P0" edc:desc="SERCOM0/PAD0" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P3" edc:desc="SERCOM0/PAD3" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P2" edc:desc="SERCOM1/PAD2" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P3" edc:desc="SERCOM1/PAD3" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO2" edc:desc="TCC0/WO2" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO0" edc:desc="TCC0/WO0" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO4" edc:desc="TCC0/WO4" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO2" edc:desc="TCC1/WO2" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO0" edc:desc="TCC1/WO0" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO4" edc:desc="TCC1/WO4" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="TCC2WO0" edc:desc="TCC2/WO0" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="TC0WO0" edc:desc="TC0/WO0" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="TC1WO0" edc:desc="TC1/WO0" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="TC2WO0" edc:desc="TC2/WO0" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="TC3WO0" edc:desc="TC3/WO0" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="TC4WO0" edc:desc="TC4/WO0" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="TC5WO0" edc:desc="TC5/WO0" edc:when="(field &amp; 0x1F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="TC6WO0" edc:desc="TC6/WO0" edc:when="(field &amp; 0x1F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="TC7WO0" edc:desc="TC7/WO0" edc:when="(field &amp; 0x1F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="QCS" edc:desc="QCS" edc:when="(field &amp; 0x1F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="QD1" edc:desc="QD1" edc:when="(field &amp; 0x1F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="QD0" edc:desc="QD0" edc:when="(field &amp; 0x1F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="QD3" edc:desc="QD3" edc:when="(field &amp; 0x1F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="CCLOUT0" edc:desc="CCLOUT0" edc:when="(field &amp; 0x1F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS1" edc:desc="TSTBUS1" edc:when="(field &amp; 0x1F) == 0x1C"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS4" edc:desc="TSTBUS4" edc:when="(field &amp; 0x1F) == 0x1D"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS7" edc:desc="TSTBUS7" edc:when="(field &amp; 0x1F) == 0x1E"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS10" edc:desc="TSTBUS10" edc:when="(field &amp; 0x1F) == 0x1F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PPS" edc:cname="RPB2G4R" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F" edc:_addr="0x440012A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="RPB2G4R" edc:nzwidth="0x5" edc:desc="RPB2/G4">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P2" edc:desc="SERCOM0/PAD2" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P0" edc:desc="SERCOM0/PAD0" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P3" edc:desc="SERCOM1/PAD3" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P0" edc:desc="SERCOM1/PAD0" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO3" edc:desc="TCC0/WO3" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO1" edc:desc="TCC0/WO1" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO5" edc:desc="TCC0/WO5" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO3" edc:desc="TCC1/WO3" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO1" edc:desc="TCC1/WO1" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO5" edc:desc="TCC1/WO5" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="TCC2WO1" edc:desc="TCC2/WO1" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="TC0WO0" edc:desc="TC0/WO0" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="TC1WO1" edc:desc="TC1/WO1" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="TC2WO1" edc:desc="TC2/WO1" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="TC3WO1" edc:desc="TC3/WO1" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="TC4WO1" edc:desc="TC4/WO1" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="TC5WO1" edc:desc="TC5/WO1" edc:when="(field &amp; 0x1F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="TC6WO1" edc:desc="TC6/WO1" edc:when="(field &amp; 0x1F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="TC7WO1" edc:desc="TC7/WO1" edc:when="(field &amp; 0x1F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="QCS" edc:desc="QCS" edc:when="(field &amp; 0x1F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="QD2" edc:desc="QD2" edc:when="(field &amp; 0x1F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="QD1" edc:desc="QD1" edc:when="(field &amp; 0x1F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="QD0" edc:desc="QD0" edc:when="(field &amp; 0x1F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="CCLOUT1" edc:desc="CCLOUT1" edc:when="(field &amp; 0x1F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS2" edc:desc="TSTBUS2" edc:when="(field &amp; 0x1F) == 0x1C"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS5" edc:desc="TSTBUS5" edc:when="(field &amp; 0x1F) == 0x1D"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS8" edc:desc="TSTBUS8" edc:when="(field &amp; 0x1F) == 0x1E"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS11" edc:desc="TSTBUS11" edc:when="(field &amp; 0x1F) == 0x1F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x440012A4"/>
      <edc:SFRDef ltx:memberofperipheral="PPS" edc:cname="RPB3G4R" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F" edc:_addr="0x440012A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="RPB3G4R" edc:nzwidth="0x5" edc:desc="RPB3/G4">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P2" edc:desc="SERCOM0/PAD2" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P0" edc:desc="SERCOM0/PAD0" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P3" edc:desc="SERCOM1/PAD3" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P0" edc:desc="SERCOM1/PAD0" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO3" edc:desc="TCC0/WO3" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO1" edc:desc="TCC0/WO1" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO5" edc:desc="TCC0/WO5" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO3" edc:desc="TCC1/WO3" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO1" edc:desc="TCC1/WO1" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO5" edc:desc="TCC1/WO5" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="TCC2WO1" edc:desc="TCC2/WO1" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="TC0WO0" edc:desc="TC0/WO0" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="TC1WO1" edc:desc="TC1/WO1" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="TC2WO1" edc:desc="TC2/WO1" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="TC3WO1" edc:desc="TC3/WO1" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="TC4WO1" edc:desc="TC4/WO1" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="TC5WO1" edc:desc="TC5/WO1" edc:when="(field &amp; 0x1F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="TC6WO1" edc:desc="TC6/WO1" edc:when="(field &amp; 0x1F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="TC7WO1" edc:desc="TC7/WO1" edc:when="(field &amp; 0x1F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="QCS" edc:desc="QCS" edc:when="(field &amp; 0x1F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="QD2" edc:desc="QD2" edc:when="(field &amp; 0x1F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="QD1" edc:desc="QD1" edc:when="(field &amp; 0x1F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="QD0" edc:desc="QD0" edc:when="(field &amp; 0x1F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="CCLOUT1" edc:desc="CCLOUT1" edc:when="(field &amp; 0x1F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS2" edc:desc="TSTBUS2" edc:when="(field &amp; 0x1F) == 0x1C"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS5" edc:desc="TSTBUS5" edc:when="(field &amp; 0x1F) == 0x1D"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS8" edc:desc="TSTBUS8" edc:when="(field &amp; 0x1F) == 0x1E"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS11" edc:desc="TSTBUS11" edc:when="(field &amp; 0x1F) == 0x1F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x440012AC"/>
      <edc:SFRDef ltx:memberofperipheral="PPS" edc:cname="RPB4G2R" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F" edc:_addr="0x440012B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="RPB4G2R" edc:nzwidth="0x5" edc:desc="RPB4G2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P0" edc:desc="SERCOM0/PAD0" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P3" edc:desc="SERCOM0/PAD3" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P2" edc:desc="SERCOM0/PAD2" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P3" edc:desc="SERCOM1/PAD3" edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P2" edc:desc="SERCOM1/PAD2" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO1" edc:desc="TCC0/WO1" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO5" edc:desc="TCC0/WO5" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO3" edc:desc="TCC0/WO3" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO1" edc:desc="TCC1/WO1" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO5" edc:desc="TCC1/WO5" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO3" edc:desc="TCC1/WO3" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="TCC2WO1" edc:desc="TCC2/WO1" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="TC0WO1" edc:desc="TC0/WO1" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="TC1WO1" edc:desc="TC1/WO1" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="TC2WO1" edc:desc="TC2/WO1" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="TC3WO1" edc:desc="TC3/WO1" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="TC4WO1" edc:desc="TC4/WO1" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="TC5WO1" edc:desc="TC5/WO1" edc:when="(field &amp; 0x1F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="TC6WO1" edc:desc="TC6/WO1" edc:when="(field &amp; 0x1F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="TC7WO1" edc:desc="TC7/WO1" edc:when="(field &amp; 0x1F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="QSPICS" edc:desc="QSPI/CS" edc:when="(field &amp; 0x1F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="QD0" edc:desc="QD0" edc:when="(field &amp; 0x1F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="QD3" edc:desc="QD3" edc:when="(field &amp; 0x1F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="QD2" edc:desc="QD2" edc:when="(field &amp; 0x1F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="CCLOUT1" edc:desc="CCLOUT1" edc:when="(field &amp; 0x1F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS0" edc:desc="TSTBUS0" edc:when="(field &amp; 0x1F) == 0x1C"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS3" edc:desc="TSTBUS3" edc:when="(field &amp; 0x1F) == 0x1D"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS6" edc:desc="TSTBUS6" edc:when="(field &amp; 0x1F) == 0x1E"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS9" edc:desc="TSTBUS9" edc:when="(field &amp; 0x1F) == 0x1F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PPS" edc:cname="RPB5G2R" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F" edc:_addr="0x440012B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="RPB5G2R" edc:nzwidth="0x5" edc:desc="RPB5/G2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P0" edc:desc="SERCOM0/PAD0" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P3" edc:desc="SERCOM0/PAD3" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P2" edc:desc="SERCOM0/PAD2" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P3" edc:desc="SERCOM1/PAD3" edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P2" edc:desc="SERCOM1/PAD2" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO1" edc:desc="TCC0/WO1" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO5" edc:desc="TCC0/WO5" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO3" edc:desc="TCC0/WO3" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO1" edc:desc="TCC1/WO1" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO5" edc:desc="TCC1/WO5" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO3" edc:desc="TCC1/WO3" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="TCC2WO1" edc:desc="TCC2/WO1" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="TC0WO1" edc:desc="TC0/WO1" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="TC1WO1" edc:desc="TC1/WO1" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="TC2WO1" edc:desc="TC2/WO1" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="TC3WO1" edc:desc="TC3/WO1" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="TC4WO1" edc:desc="TC4/WO1" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="TC5WO1" edc:desc="TC5/WO1" edc:when="(field &amp; 0x1F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="TC6WO1" edc:desc="TC6/WO1" edc:when="(field &amp; 0x1F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="TC7WO1" edc:desc="TC7/WO1" edc:when="(field &amp; 0x1F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="QSPICS" edc:desc="QSPI/CS" edc:when="(field &amp; 0x1F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="QD0" edc:desc="QD0" edc:when="(field &amp; 0x1F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="QD3" edc:desc="QD3" edc:when="(field &amp; 0x1F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="QD2" edc:desc="QD2" edc:when="(field &amp; 0x1F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="CCLOUT1" edc:desc="CCLOUT1" edc:when="(field &amp; 0x1F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS0" edc:desc="TSTBUS0" edc:when="(field &amp; 0x1F) == 0x1C"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS3" edc:desc="TSTBUS3" edc:when="(field &amp; 0x1F) == 0x1D"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS6" edc:desc="TSTBUS6" edc:when="(field &amp; 0x1F) == 0x1E"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS9" edc:desc="TSTBUS9" edc:when="(field &amp; 0x1F) == 0x1F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
