Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:AdjustPoint edc:offset="0x104" edc:_addr="0x440012FC"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON1" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnn-nnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFEF7F" edc:_addr="0x44001400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="DMABL" edc:nzwidth="0x3" edc:desc="DMA to System RAM Buffer Length Size bits">
              <edc:SFRFieldSemantic edc:cname="128_DMABL" edc:desc="Allocates 128 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="64_DMABL" edc:desc="Allocates 64 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="32_DMABL" edc:desc="Allocates 32 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="16_DMABL" edc:desc="Allocates 16 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="8_DMABL" edc:desc="Allocates 8 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="4_DMABL" edc:desc="Allocates 4 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="2_DMABL" edc:desc="Allocates 2 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="1_DMABL" edc:desc="Allocates 1 location in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STRGLVL" edc:nzwidth="0x1" edc:desc="Scan Trigger High Level/Positive Edge Sensitivity bit">
              <edc:SFRFieldSemantic edc:cname="SCTRIG_HIGH" edc:desc="Scan trigger is high level sensitive. Once STRIG mode is selected the scan trigger will continue for all selected analog inputs" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SCTRIG_POSEDGE" edc:desc="Scan trigger is positive edge sensitive. Once STRIG mode is selected only a single scan trigger will be generated which will complete the scan of all selected analog inputs. (TRGSRCx in the ADCTRGx register)" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IRQVS" edc:nzwidth="0x3" edc:desc="Interrupt Vector Shift bits">
              <edc:SFRFieldSemantic edc:cname="SHL_7" edc:desc="Shift x left 7 bit position" edc:when="(field &amp; 0x7) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="SHL_6" edc:desc="Shift x left 6 bit position" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="SHL_5" edc:desc="Shift x left 5 bit position" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="SHL_4" edc:desc="Shift x left 4 bit position" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SHL_3" edc:desc="Shift x left 3 bit position" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SHL_2" edc:desc="Shift x left 2 bit position" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SHL_1" edc:desc="Shift x left 1 bit position" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SHL_0" edc:desc="Shift x left 0 bit position" edc:when="(field &amp; 0x7) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SCANEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSYUPB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSYDMA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CVD_EN" edc:nzwidth="0x1" edc:desc="CVD Enable bit"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1" edc:desc="Stop in Idle Mode bit">
              <edc:SFRFieldSemantic edc:cname="DISCONTINUE" edc:desc="Discontinue module operation when device enters Idle mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CONTINUE" edc:desc="Continue module operation in Idle mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1" edc:desc="ADC Module Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="ADC module is enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="ADC module is disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STRGSRC" edc:nzwidth="0x5" edc:desc="Scan Trigger Source Select bits">
              <edc:SFRFieldSemantic edc:cname="EXT_TRIG_VAL" edc:desc="External trigger for validation" edc:when="(field &amp; 0x1F) == 0x1F"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_47" edc:desc="ADC_TRIG_16" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_46" edc:desc="ADC_TRIG_15" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_45" edc:desc="ADC_TRIG_14" edc:when="(field &amp; 0x1F) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_44" edc:desc="ADC_TRIG_13" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_43" edc:desc="ADC_TRIG_12" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_42" edc:desc="ADC_TRIG_11" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_41" edc:desc="ADC_TRIG_10" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_40" edc:desc="ADC_TRIG_9" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_39" edc:desc="ADC_TRIG_8" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_38" edc:desc="ADC_TRIG_7" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_37" edc:desc="ADC_TRIG_6" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_36" edc:desc="ADC_TRIG_5" edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="INT0" edc:desc="INT0" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SW_LVL" edc:desc="Software level trigger" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SW_EDGE" edc:desc="Software edge trigger" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Trigger" edc:when="(field &amp; 0x1F) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SELRES" edc:nzwidth="0x2" edc:desc="Shared ADC7 Resolution bits">
              <edc:SFRFieldSemantic edc:cname="12_BITS" edc:desc="12 bits (default)" edc:when="(field &amp; 0x3) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="10_BITS" edc:desc="10 bits" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="8_BITS" edc:desc="8 bits" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="6_BITS" edc:desc="6 bits" edc:when="(field &amp; 0x3) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRACT" edc:nzwidth="0x1" edc:desc="Fractional Data Output Format bit">
              <edc:SFRFieldSemantic edc:cname="FRAC" edc:desc="Fractional" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="INT" edc:desc="Integer" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON1CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001404"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON1SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001408"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON1INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400140C"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnn-nnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFEF7F" edc:_addr="0x44001410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:nzwidth="0x7" edc:desc="Shared ADC Clock Divider bits"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:nzwidth="0x3" edc:desc="Shared ADC Early Interrupt Select bits">
              <edc:SFRFieldSemantic edc:cname="8CLKS_EARLY" edc:desc="The data ready interrupt is generated 8 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="7CLKS_EARLY" edc:desc="The data ready interrupt is generated 7 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="6CLKS_EARLY" edc:desc="The data ready interrupt is generated 6 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="5CLKS_EARLY" edc:desc="The data ready interrupt is generated 5 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="4CLKS_EARLY" edc:desc="The data ready interrupt is generated 4 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="3CLKS_EARLY" edc:desc="The data ready interrupt is generated 3 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="2CLKS_EARLY" edc:desc="The data ready interrupt is generated 2 ADC module clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="1CLKS_EARLY" edc:desc="The data ready interrupt is generated 1 ADC module clock prior to end of conversion" edc:when="(field &amp; 0x7) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ENXCNVRT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSIEN" edc:nzwidth="0x1" edc:desc="End of Scan Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="EOSRDY_INT" edc:desc="Interrupt will be generated when EOSRDY bit is set" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOEOSRDY_INT" edc:desc="No interrupt is generated when the EOSRDY bit is set" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="REFFLTIEN" edc:nzwidth="0x1" edc:desc="Band Gap/ Vref Voltage Fault Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="REFFLT_INT" edc:desc="Interrupt will be generated when the REFFLT bit is set" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOREFFLT_INT" edc:desc="No interrupt is generated when the REFFLT bit is set" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BGVRIEN" edc:nzwidth="0x1" edc:desc="Band Gap/ Vref Voltage Ready Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="BGVRDDY_INT" edc:desc="Interrupt will be generated when the BGVRDDY bit is set" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOBGVRDDY_INT" edc:desc="No interrupt is generated when the BGVRRDY bit is set" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SAMC" edc:nzwidth="0xA" edc:desc="Sample Time for the Shared ADC (ADC7) bits"/>
            <edc:SFRFieldDef edc:cname="CVD_CPL" edc:nzwidth="0x3" edc:desc="CVD Partly Line Capacitor Setting bits"/>
            <edc:SFRFieldDef edc:cname="EOSRDY" edc:nzwidth="0x1" edc:desc="End of Scan Interrupt Status bit">
              <edc:SFRFieldSemantic edc:cname="SCAN_COMPLETE" edc:desc="All analog inputs are considered for scanning through the scan trigger (all analog inputs specified in the ADCCSS1 and ADCCSS2 registers) have completed scanning" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SCAN_NOT_COMPLETE" edc:desc="Scanning has not completed" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="REFFLT" edc:nzwidth="0x1" edc:desc="Band Gap/ Vref / AVdd BOR Fault Status bit">
              <edc:SFRFieldSemantic edc:cname="BG_VREF_FLT" edc:desc="Fault in band gap or the Vref voltage while the ON bit (ADCCON1) was set. Most likely a band gap or Vref fault will be caused by a BOR of the analog Vdd supply." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="BG_VREF_OK" edc:desc="Band gap and Vref voltage are working properly" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BGVRRDY" edc:nzwidth="0x1" edc:desc="Band Gap Voltage/ADC Reference Voltage Status bit">
              <edc:SFRFieldSemantic edc:cname="VREF_RDY" edc:desc="Both band gap voltage and ADC reference voltages (Vref) are ready" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="VREF_NOTRDY" edc:desc="Either or both band gap voltage and ADC reference voltages (Vref) are not ready" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON2CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001414"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON2SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001418"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON2INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400141C"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON3" edc:nzwidth="0x20" edc:access="nnnnnnnnn-------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF80FFFF" edc:_addr="0x44001420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="ADINSEL" edc:nzwidth="0x6" edc:desc="Analog Input Select bits">
              <edc:SFRFieldSemantic edc:cname="TMP_SENSE" edc:desc="CTMU Temperature Sensor (internal AN11)" edc:when="(field &amp; 0x3F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="VBATDIV2_SENSE" edc:desc="VBAT/2 (internal AN10)" edc:when="(field &amp; 0x3F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="1P2V_SENSE" edc:desc="IVref 1.2V (internal AN9)" edc:when="(field &amp; 0x3F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="BGREF" edc:desc="BandGap Reference (internal AN8)" edc:when="(field &amp; 0x3F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="AN7" edc:desc="AN7" edc:when="(field &amp; 0x3F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="AN6" edc:desc="AN6" edc:when="(field &amp; 0x3F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="AN5" edc:desc="AN5" edc:when="(field &amp; 0x3F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="AN4" edc:desc="AN4" edc:when="(field &amp; 0x3F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="AN3" edc:desc="AN3" edc:when="(field &amp; 0x3F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="AN2" edc:desc="AN2" edc:when="(field &amp; 0x3F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="AN1" edc:desc="AN1" edc:when="(field &amp; 0x3F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="AN0" edc:desc="AN0" edc:when="(field &amp; 0x3F) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="GSWTRG" edc:nzwidth="0x1" edc:desc="Global Software Trigger bit">
              <edc:SFRFieldSemantic edc:cname="GSWTRG" edc:desc="Trigger conversion for ADC inputs that have selected the GSWTRG bit as either through the associated TRGSRC bits in the ADCTRGx registers or through the STRGSRC&lt;4:0&gt; bits in the ADCCON1 register the trigger signal" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_GSWTRG" edc:desc="Do not trigger an analog-to-digital conversion" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="GLSWTRG" edc:nzwidth="0x1" edc:desc="Global Level Software Trigger bit">
              <edc:SFRFieldSemantic edc:cname="GLSWTRG" edc:desc="Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_GLSWTRG" edc:desc="Do not trigger an analog-to-digital conversion" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RQCNVRT" edc:nzwidth="0x1" edc:desc="Individual ADC Input Conversion Request bit">
              <edc:SFRFieldSemantic edc:cname="IND_TRIGGER" edc:desc="Trigger the conversion of the selected ADC input as specified by the ADINSEL bits" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_TRIGGER" edc:desc="Do not trigger the conversion" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SAMP" edc:nzwidth="0x1" edc:desc="Shared ADC7 Analog Input Sampling Enable bit ">
              <edc:SFRFieldSemantic edc:cname="SAMPLE" edc:desc="The ADC S&amp;H amplifier is sampling" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="HOLD" edc:desc="The ADC S&amp;H amplifier is holding" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UPDRDY" edc:nzwidth="0x1" edc:desc="ADC Update Ready Status bit">
              <edc:SFRFieldSemantic edc:cname="UPDATE_RDY" edc:desc="ADC SFRs can be updated" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE_NOT_RDY" edc:desc="ADC SFRs cannot be updated" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UPDIEN" edc:nzwidth="0x1" edc:desc="Update Ready Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="INT_ON_UPDATE_RDY" edc:desc="Interrupt will be generated when the UPDRDY bit is set by hardware" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_INT_ON_UPDATE_RDY" edc:desc="No interrupt is generated" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGSUSP" edc:nzwidth="0x1" edc:desc="Trigger Suspend bit">
              <edc:SFRFieldSemantic edc:cname="TRIG_BLOCKED" edc:desc="Triggers are blocked from starting a new analog-to-digital conversion" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="TRIG_NOT_BLOCKED" edc:desc="Triggers are not blocked" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VREFSEL" edc:nzwidth="0x3" edc:desc="Voltage Reference Input Selection bits">
              <edc:SFRFieldSemantic edc:cname="AVDD_AVSS" edc:desc="ADC VREFH is AVDD, ADC VREFL is AVSS" edc:when="(field &amp; 0x7) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DIGEN7" edc:nzwidth="0x1" edc:desc="Shared ADC (ADC7) Digital Enable bit"/>
            <edc:SFRFieldDef edc:cname="CONCLKDIV" edc:nzwidth="0x6" edc:desc="Analog-to-Digital Control Clock Divider bits"/>
            <edc:SFRFieldDef edc:cname="ADCSEL" edc:nzwidth="0x2" edc:desc="Analog-to-Digital Clock Source bits">
              <edc:SFRFieldSemantic edc:cname="SYSCLK" edc:desc="SYSCLK" edc:when="(field &amp; 0x3) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="REFCLK3" edc:desc="REFCLK3" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="FRC" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PBCLK1" edc:desc="PBCLK1" edc:when="(field &amp; 0x3) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
