Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCDSTAT1CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440014C4"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCDSTAT1SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440014C8"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCDSTAT1INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440014CC"/>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x440014D0"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMPEN1" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x440014E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMPEN0CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440014E4"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMPEN0SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440014E8"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMPEN0INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440014EC"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMP1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440014F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="ADCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="ADCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMP0CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440014F4"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMP0SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440014F8"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMP0INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440014FC"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMPEN2" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x44001500">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMPEN1CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001504"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMPEN1SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001508"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMPEN1INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400150C"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMP2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001510">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="ADCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="ADCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
