Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44001E84"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCDATA9" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001E90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44001E94"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCDATA10" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001EA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44001EA4"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCDATA11" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001EB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x54C" edc:_addr="0x44001EB4"/>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDCON" edc:nzwidth="0x20" edc:access="nnnnn-nnn---nnnnnnnnnnnn--nnnnnn" edc:por="00000000000000100000000000000000" edc:mclr="00000000000000100000000000000000" edc:impl="0xFB8FFF3F" edc:_addr="0x44002400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="TRIGSEL" edc:nzwidth="0x4" edc:desc="Selects one of 15 external trigger inputs to start scanning."/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:nzwidth="0x2" edc:desc="Clock Select for FSM00= UPB_FSM_CLK01= External clock source 110= External clock source 211= External clock source 3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FIFOTH" edc:nzwidth="0xA" edc:desc="Threshold for the results FIFO that will cause an interrupt and watermark FIFOWM status bitassertion"/>
            <edc:SFRFieldDef edc:cname="FIFOTHIEN" edc:nzwidth="0x1" edc:desc="FIFO Threshold Interrupt Enable1= Controller will assert an interrupt when the FIFO threshold is met0= Controller will not assert an interrupt when the FIFO threshold is met"/>
            <edc:SFRFieldDef edc:cname="CVDIEN" edc:nzwidth="0x1" edc:desc="Global Interrupt Enable for full macro. Gates any enabled FIFO or Scan Descriptor interrupts."/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="THSTR" edc:nzwidth="0x1" edc:desc="Threshold Store Mode1= Store only results which exceed the programmed threshold for the Scan Descriptor0= Store all results in FIFO"/>
            <edc:SFRFieldDef edc:cname="SWTRIG" edc:nzwidth="0x1" edc:desc="Software Trigger control. Starts scan manuallyCleared by Hardware."/>
            <edc:SFRFieldDef edc:cname="ABORT" edc:nzwidth="0x1" edc:desc="Instructs the controller to abort the current scan. The controller will move on to the next enabled ScanDescriptor if there is one, else it will go idle.Cleared by Hardware"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDWREN" edc:nzwidth="0x1" edc:desc="Scan Descriptor Write Enable1= Enables writes to the scan descriptors, and prevents Scan Descriptor EN bits from being decoded and captured intoFSM_CLK domain by the Descriptor Selection Logic. This simplifies synchronization issues. The currently active ScanDescriptor registers should NOT be written even if SDWREN is asserted, as the FSM uses those bits directly without asynchronizer as a means of saving gates.0= Prevents writes to the scan descriptors, and enables the Descriptor Selector Logic to decode the next Scan Descriptor to run and capture it into the FSM domain."/>
            <edc:SFRFieldDef edc:cname="ORDER" edc:nzwidth="0x1" edc:desc="RX/TX Loop Order1= Scan all requested TX indexes, then increment RX index and continue0= Scan all requested RX indexes, then increment TX index and continue"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1" edc:desc="Stop in Idle Mode bit1= CVD controller halts when device enters Idle mode0= CVD controller continues running in Idle mode"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Freeze Mode1= CVD controller halts in debugger mode0= CVD controller runs in debugger mode"/>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1" edc:desc="Enables the State Machine to scan enabled Scan Descriptors upon next trigger."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDADC" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF" edc:_addr="0x44002404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SELRES" edc:nzwidth="0x2" edc:desc="Shared ADC Resolution bits"/>
            <edc:SFRFieldDef edc:cname="DIFFPEN" edc:nzwidth="0x1" edc:desc="Control differential mode operation of ANN0"/>
            <edc:SFRFieldDef edc:cname="DIGEN" edc:nzwidth="0x1" edc:desc="Control differential mode operation of ANN0"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDSTAT" edc:nzwidth="0x20" edc:access="nnn---nnnnnnnnnn-nnn-nnn-nnn-nnn" edc:por="00100000000000000000000000000000" edc:mclr="00100000000000000000000000000000" edc:impl="0xE3FF7777" edc:_addr="0x44002408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SD1BUSY" edc:nzwidth="0x1" edc:desc="Scan Descriptor 1 is in progress"/>
            <edc:SFRFieldDef edc:cname="SD1DONE" edc:nzwidth="0x1" edc:desc="Core will set this bit if Scan Descriptor 1 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 1."/>
            <edc:SFRFieldDef edc:cname="SD1INT" edc:nzwidth="0x1" edc:desc="Scan Descriptor 1 has caused an interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD2BUSY" edc:nzwidth="0x1" edc:desc="Scan Descriptor 2 is in progress"/>
            <edc:SFRFieldDef edc:cname="SD2DONE" edc:nzwidth="0x1" edc:desc="Core will set this bit if Scan Descriptor 2 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 2."/>
            <edc:SFRFieldDef edc:cname="SD2INT" edc:nzwidth="0x1" edc:desc="Scan Descriptor 2 has caused an interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD3BUSY" edc:nzwidth="0x1" edc:desc="Scan Descriptor 3 is in progress"/>
            <edc:SFRFieldDef edc:cname="SD3DONE" edc:nzwidth="0x1" edc:desc="Core will set this bit if Scan Descriptor 3 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 3."/>
            <edc:SFRFieldDef edc:cname="SD3INT" edc:nzwidth="0x1" edc:desc="Scan Descriptor 3 has caused an interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD4BUSY" edc:nzwidth="0x1" edc:desc="Scan Descriptor 4 is in progress"/>
            <edc:SFRFieldDef edc:cname="SD4DONE" edc:nzwidth="0x1" edc:desc="Core will set this bit if Scan Descriptor 4 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 4."/>
            <edc:SFRFieldDef edc:cname="SD4INT" edc:nzwidth="0x1" edc:desc="Scan Descriptor 4 has caused an interrupt."/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCNT" edc:nzwidth="0xA" edc:desc="Results FIFO word count: Indicates the number of words in the Results FIFO."/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FIFOMT" edc:nzwidth="0x1" edc:desc="The Results FIFO is empty."/>
            <edc:SFRFieldDef edc:cname="FIFOWM" edc:nzwidth="0x1" edc:desc="The Results FIFO has reached the programmed FIFOTHRESH threshold."/>
            <edc:SFRFieldDef edc:cname="FIFOFULL" edc:nzwidth="0x1" edc:desc="The Results FIFO is full."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4400240C"/>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDRESH" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x44002410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="POS" edc:nzwidth="0x18" edc:desc="The accumulated result of the positive-side measurements.Since the controller supports up to 128x oversampling, each polarity can accumulate up to 23 bits when using a 16-bitADC. The accumulation is not shifted back down to create an average. Therefore, if oversampling was requested, theSW will need to account for the left-shift of the result returned."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDRESL" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x44002414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="NEG" edc:nzwidth="0x18" edc:desc="The accumulated result of the negative-side measurements.Since the controller supports up to 128x oversampling, each polarity can accumulate up to 23 bits when using a 16-bitADC. The accumulation is not shifted back down to create an average. Therefore, if oversampling was requested, theSW will need to account for the left-shift of the result returned."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDRESD" edc:nzwidth="0x20" edc:access="rrrrr-rrrrrrr-rrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFBFBFFFF" edc:_addr="0x44002418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="DELTA" edc:nzwidth="0x12" edc:desc="Delta of the accumulated results of the negative-side and positive-side measurements."/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXINDEX" edc:nzwidth="0x5" edc:desc="Receive Index for this result. If the Stride of the Scan Descriptor was more than one, the ReceiveIndex indicates the first one of the group."/>
            <edc:SFRFieldDef edc:cname="SDNUM" edc:nzwidth="0x2" edc:desc="Scan Descriptor Number that generated this result"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXINDEX" edc:nzwidth="0x5" edc:desc="Transmit Index for this result. If the Stride of the Scan Descriptor was more than one, the Transmit Index indicates the first one of the group."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x64" edc:_addr="0x4400241C"/>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDRX0" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F3F3F3F" edc:_addr="0x44002480">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="RXAN0" edc:nzwidth="0x6" edc:desc="ANx/CVDR channel to use for RX Index 4n+3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN1" edc:nzwidth="0x6" edc:desc="ANx/CVDR channel to use for RX Index 4n+3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN2" edc:nzwidth="0x6" edc:desc="ANx/CVDR channel to use for RX Index 4n+3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN3" edc:nzwidth="0x6" edc:desc="ANx/CVDR channel to use for RX Index 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDRX1" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F3F3F3F" edc:_addr="0x44002484">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="RXAN0" edc:nzwidth="0x6" edc:desc="ANx/CVDR channel to use for RX Index 4n+3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN1" edc:nzwidth="0x6" edc:desc="ANx/CVDR channel to use for RX Index 4n+3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN2" edc:nzwidth="0x6" edc:desc="ANx/CVDR channel to use for RX Index 4n+3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN3" edc:nzwidth="0x6" edc:desc="ANx/CVDR channel to use for RX Index 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x38" edc:_addr="0x44002488"/>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDTX0" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F3F3F3F" edc:_addr="0x440024C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="TXAN0" edc:nzwidth="0x6" edc:desc="CVDT channel to use for TX Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN1" edc:nzwidth="0x6" edc:desc="CVDT channel to use for TX Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN2" edc:nzwidth="0x6" edc:desc="CVDT channel to use for TX Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN3" edc:nzwidth="0x6" edc:desc="CVDT channel to use for TX Index"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDTX1" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F3F3F3F" edc:_addr="0x440024C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="TXAN0" edc:nzwidth="0x6" edc:desc="CVDT channel to use for TX Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN1" edc:nzwidth="0x6" edc:desc="CVDT channel to use for TX Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN2" edc:nzwidth="0x6" edc:desc="CVDT channel to use for TX Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN3" edc:nzwidth="0x6" edc:desc="CVDT channel to use for TX Index"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x38" edc:_addr="0x440024C8"/>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDSD0C1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF7F" edc:_addr="0x44002500">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SDOVRSAMP" edc:nzwidth="0x7" edc:desc="Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDTH" edc:nzwidth="0x18" edc:desc="Scan Descriptor Threshold."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDSD0C2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002504">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SDRXBEG" edc:nzwidth="0x6" edc:desc="Scan Descriptor RX Index StartDetermines the first RX index to include in a scan."/>
            <edc:SFRFieldDef edc:cname="SDRXSTRIDE0" edc:nzwidth="0x2" edc:desc="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes"/>
            <edc:SFRFieldDef edc:cname="SDRXEND" edc:nzwidth="0x6" edc:desc="Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete."/>
            <edc:SFRFieldDef edc:cname="SDRXSTRIDE1" edc:nzwidth="0x2" edc:desc="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes"/>
            <edc:SFRFieldDef edc:cname="SDTXBEG" edc:nzwidth="0x6" edc:desc="Scan Descriptor TX Index StartDetermines the first TX index to include in a scan."/>
            <edc:SFRFieldDef edc:cname="SDTXSTRIDE0" edc:nzwidth="0x2" edc:desc="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes"/>
            <edc:SFRFieldDef edc:cname="SDTXEND" edc:nzwidth="0x6" edc:desc="Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete."/>
            <edc:SFRFieldDef edc:cname="SDTXSTRIDE1" edc:nzwidth="0x2" edc:desc="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDSD0C3" edc:nzwidth="0x20" edc:access="nn--nnnn----nnnn-nnnnnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xCF0F7F7F" edc:_addr="0x44002508">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SDCHGTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CHARGE statedriving both the internal and external capacitor nodes, as well as the TX output(s)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDACQTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Acquire TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the ACQUIRE stateto allow the ADC voltage to settle"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CVDCPL" edc:nzwidth="0x3" edc:desc="Capacitor Voltage Divider (CVD) Setting bits"/>
            <edc:SFRFieldDef edc:cname="CVDEN" edc:nzwidth="0x1" edc:desc=" Capacitive Voltage Division Enable bit"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SDMUT" edc:nzwidth="0x1" edc:desc="Scan Descriptor Mutual Mode1= Mutual Measurement Mode; TX outputs are part of CVD measurement and are driven0=No Mutual Measurement Mode; TX outputs are not part of CVD measurements"/>
            <edc:SFRFieldDef edc:cname="SDSELF" edc:nzwidth="0x1" edc:desc="Scan Descriptor Mutual Mode1= Self Measurement Mode; RX outputs are part of CVD measurement and are driven0= No Self Measurement; RX outputs are not part of CVD measurements"/>
            <edc:SFRFieldDef edc:cname="SDINTEN" edc:nzwidth="0x1" edc:desc="Scan Descriptor Interrupt Enable1= Scan Descriptor creates an interrupt if the accumulator threshold is met0= Scan descriptor does not create an interrupt"/>
            <edc:SFRFieldDef edc:cname="SDBUF" edc:nzwidth="0x1" edc:desc="Scan Descriptor CVD Buffer Enable1= Use the SOC's CVD Buffer macro to drive the party-line (shared ADC core input) rather than the RX outputs0= SOC's CVD Buffer macro not used to drive party-line (or doesn't exist)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SDEN" edc:nzwidth="0x2" edc:desc="Scan Descriptor Enable Mode00= Scan Descriptor Disabled01= Execute Scan Descriptor one time only, then clear the enable.10= Execute the Scan Descriptor, but keep enabled. Move on to next enabled descriptors.11= Execute the Scan Descriptor in a loop until a threshold match is detected, then clear the enable and move on tonext enabled descriptors."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
