Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDSD2C1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF7F" edc:_addr="0x44002520">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SDOVRSAMP" edc:nzwidth="0x7" edc:desc="Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDTH" edc:nzwidth="0x18" edc:desc="Scan Descriptor Threshold."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDSD2C2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002524">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SDRXBEG" edc:nzwidth="0x6" edc:desc="Scan Descriptor RX Index StartDetermines the first RX index to include in a scan."/>
            <edc:SFRFieldDef edc:cname="SDRXSTRIDE0" edc:nzwidth="0x2" edc:desc="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes"/>
            <edc:SFRFieldDef edc:cname="SDRXEND" edc:nzwidth="0x6" edc:desc="Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete."/>
            <edc:SFRFieldDef edc:cname="SDRXSTRIDE1" edc:nzwidth="0x2" edc:desc="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes"/>
            <edc:SFRFieldDef edc:cname="SDTXBEG" edc:nzwidth="0x6" edc:desc="Scan Descriptor TX Index StartDetermines the first TX index to include in a scan."/>
            <edc:SFRFieldDef edc:cname="SDTXSTRIDE0" edc:nzwidth="0x2" edc:desc="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes"/>
            <edc:SFRFieldDef edc:cname="SDTXEND" edc:nzwidth="0x6" edc:desc="Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete."/>
            <edc:SFRFieldDef edc:cname="SDTXSTRIDE1" edc:nzwidth="0x2" edc:desc="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDSD2C3" edc:nzwidth="0x20" edc:access="nn--nnnn----nnnn-nnnnnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xCF0F7F7F" edc:_addr="0x44002528">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SDCHGTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CHARGE statedriving both the internal and external capacitor nodes, as well as the TX output(s)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDACQTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Acquire TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the ACQUIRE stateto allow the ADC voltage to settle"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CVDCPL" edc:nzwidth="0x3" edc:desc="Capacitor Voltage Divider (CVD) Setting bits"/>
            <edc:SFRFieldDef edc:cname="CVDEN" edc:nzwidth="0x1" edc:desc=" Capacitive Voltage Division Enable bit"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SDMUT" edc:nzwidth="0x1" edc:desc="Scan Descriptor Mutual Mode1= Mutual Measurement Mode; TX outputs are part of CVD measurement and are driven0=No Mutual Measurement Mode; TX outputs are not part of CVD measurements"/>
            <edc:SFRFieldDef edc:cname="SDSELF" edc:nzwidth="0x1" edc:desc="Scan Descriptor Mutual Mode1= Self Measurement Mode; RX outputs are part of CVD measurement and are driven0= No Self Measurement; RX outputs are not part of CVD measurements"/>
            <edc:SFRFieldDef edc:cname="SDINTEN" edc:nzwidth="0x1" edc:desc="Scan Descriptor Interrupt Enable1= Scan Descriptor creates an interrupt if the accumulator threshold is met0= Scan descriptor does not create an interrupt"/>
            <edc:SFRFieldDef edc:cname="SDBUF" edc:nzwidth="0x1" edc:desc="Scan Descriptor CVD Buffer Enable1= Use the SOC's CVD Buffer macro to drive the party-line (shared ADC core input) rather than the RX outputs0= SOC's CVD Buffer macro not used to drive party-line (or doesn't exist)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SDEN" edc:nzwidth="0x2" edc:desc="Scan Descriptor Enable Mode00= Scan Descriptor Disabled01= Execute Scan Descriptor one time only, then clear the enable.10= Execute the Scan Descriptor, but keep enabled. Move on to next enabled descriptors.11= Execute the Scan Descriptor in a loop until a threshold match is detected, then clear the enable and move on tonext enabled descriptors."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDSD2T2" edc:nzwidth="0x20" edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F7F7F7F" edc:_addr="0x4400252C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SDCONTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires."/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDPOLTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDOVRTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair."/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDCHNTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDSD3C1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF7F" edc:_addr="0x44002530">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SDOVRSAMP" edc:nzwidth="0x7" edc:desc="Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDTH" edc:nzwidth="0x18" edc:desc="Scan Descriptor Threshold."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDSD3C2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002534">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SDRXBEG" edc:nzwidth="0x6" edc:desc="Scan Descriptor RX Index StartDetermines the first RX index to include in a scan."/>
            <edc:SFRFieldDef edc:cname="SDRXSTRIDE0" edc:nzwidth="0x2" edc:desc="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes"/>
            <edc:SFRFieldDef edc:cname="SDRXEND" edc:nzwidth="0x6" edc:desc="Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete."/>
            <edc:SFRFieldDef edc:cname="SDRXSTRIDE1" edc:nzwidth="0x2" edc:desc="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes"/>
            <edc:SFRFieldDef edc:cname="SDTXBEG" edc:nzwidth="0x6" edc:desc="Scan Descriptor TX Index StartDetermines the first TX index to include in a scan."/>
            <edc:SFRFieldDef edc:cname="SDTXSTRIDE0" edc:nzwidth="0x2" edc:desc="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes"/>
            <edc:SFRFieldDef edc:cname="SDTXEND" edc:nzwidth="0x6" edc:desc="Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete."/>
            <edc:SFRFieldDef edc:cname="SDTXSTRIDE1" edc:nzwidth="0x2" edc:desc="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDSD3C3" edc:nzwidth="0x20" edc:access="nn--nnnn----nnnn-nnnnnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xCF0F7F7F" edc:_addr="0x44002538">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SDCHGTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CHARGE statedriving both the internal and external capacitor nodes, as well as the TX output(s)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDACQTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Acquire TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the ACQUIRE stateto allow the ADC voltage to settle"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CVDCPL" edc:nzwidth="0x3" edc:desc="Capacitor Voltage Divider (CVD) Setting bits"/>
            <edc:SFRFieldDef edc:cname="CVDEN" edc:nzwidth="0x1" edc:desc=" Capacitive Voltage Division Enable bit"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SDMUT" edc:nzwidth="0x1" edc:desc="Scan Descriptor Mutual Mode1= Mutual Measurement Mode; TX outputs are part of CVD measurement and are driven0=No Mutual Measurement Mode; TX outputs are not part of CVD measurements"/>
            <edc:SFRFieldDef edc:cname="SDSELF" edc:nzwidth="0x1" edc:desc="Scan Descriptor Mutual Mode1= Self Measurement Mode; RX outputs are part of CVD measurement and are driven0= No Self Measurement; RX outputs are not part of CVD measurements"/>
            <edc:SFRFieldDef edc:cname="SDINTEN" edc:nzwidth="0x1" edc:desc="Scan Descriptor Interrupt Enable1= Scan Descriptor creates an interrupt if the accumulator threshold is met0= Scan descriptor does not create an interrupt"/>
            <edc:SFRFieldDef edc:cname="SDBUF" edc:nzwidth="0x1" edc:desc="Scan Descriptor CVD Buffer Enable1= Use the SOC's CVD Buffer macro to drive the party-line (shared ADC core input) rather than the RX outputs0= SOC's CVD Buffer macro not used to drive party-line (or doesn't exist)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SDEN" edc:nzwidth="0x2" edc:desc="Scan Descriptor Enable Mode00= Scan Descriptor Disabled01= Execute Scan Descriptor one time only, then clear the enable.10= Execute the Scan Descriptor, but keep enabled. Move on to next enabled descriptors.11= Execute the Scan Descriptor in a loop until a threshold match is detected, then clear the enable and move on tonext enabled descriptors."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDSD3T2" edc:nzwidth="0x20" edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F7F7F7F" edc:_addr="0x4400253C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SDCONTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires."/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDPOLTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDOVRTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair."/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDCHNTIME" edc:nzwidth="0x7" edc:desc="Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
