Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:AdjustPoint edc:offset="0xC0" edc:_addr="0x44002540"/>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDBG" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002600">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SEL_L" edc:nzwidth="0x10" edc:desc="Select signal to MUX debug signals on to port cvd_tst_dbg_data[15:0]"/>
            <edc:SFRFieldDef edc:cname="SEL_H" edc:nzwidth="0x10" edc:desc="Select signal to MUX debug signals on to port cvd_tst_dbg_data[31:16]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3FC" edc:_addr="0x44002604"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ANSEL" edc:nzwidth="0x20" edc:access="-----------------nnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF" edc:_addr="0x44002A00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="ANS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ANSELCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A04"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ANSELSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A08"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ANSELINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A0C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="TRIS" edc:nzwidth="0x20" edc:access="-----------------nnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF" edc:_addr="0x44002A10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="TRIS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="TRISCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A14"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="TRISSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A18"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="TRISINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A1C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="PORT" edc:nzwidth="0x20" edc:access="-----------------nnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF" edc:_addr="0x44002A20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="R0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
