Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="PORTCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A24"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="PORTSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A28"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="PORTINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A2C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="LAT" edc:nzwidth="0x20" edc:access="-----------------nnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF" edc:_addr="0x44002A30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="LAT0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="LATCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A34"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="LATSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A38"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="LATINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A3C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ODC" edc:nzwidth="0x20" edc:access="-----------------nnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF" edc:_addr="0x44002A40">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="ODC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ODCCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A44"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ODCSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A48"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ODCINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A4C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNPU" edc:nzwidth="0x20" edc:access="-----------------nnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF" edc:_addr="0x44002A50">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="CNPU0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNPUCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A54"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNPUSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A58"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNPUINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A5C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNPD" edc:nzwidth="0x20" edc:access="-----------------nnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF" edc:_addr="0x44002A60">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="CNPD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
