Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="SRCON1CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002BD4"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="SRCON1SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002BD8"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="SRCON1INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002BDC"/>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x44002BE0"/>
      <edc:SFRDef ltx:memberofperipheral="ROT" edc:cname="SECCFG" edc:nzwidth="0x20" edc:access="---------------n----nnnnnnnn----" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x10FF0" edc:_addr="0x44002C00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ROT">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="UUID_LOCK" edc:nzwidth="0x2" edc:desc="Programming lock bits for Unique ID fuses">
              <edc:SFRFieldSemantic edc:cname="UUID_NOT_LCK_0" edc:desc="Unique ID is not locked" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="UUID_LCK_1" edc:desc="Unique ID is locked and cannot be programmed" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UUID_LCK_2" edc:desc="Unique ID is locked and cannot be programmed" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="UUID_LCK_3" edc:desc="Unique ID is locked and cannot be programmed" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DEBUG_LOCK" edc:nzwidth="0x2" edc:desc="Lock bits for debug/programming">
              <edc:SFRFieldSemantic edc:cname="DEBUG_NOT_LCK_0" edc:desc="Debug is not locked" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DEBUG_LCK_1" edc:desc="Debug is locked" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DEBUG_LCK_2" edc:desc="Debug is locked" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DEBUG_LCK_3" edc:desc="Debug is locked" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ROOT_KEY_LOCK" edc:nzwidth="0x2" edc:desc="Lock bits for storage root Key">
              <edc:SFRFieldSemantic edc:cname="ROOT_KEY_NOT_LCK_0" edc:desc="Storage root key is not locked" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ROOT_KEY_LCK_1" edc:desc="Storage root key is locked and cannot be programmed" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="ROOT_KEY_LCK_2" edc:desc="Storage root key is locked and cannot be programmed" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ROOT_KEY_LCK_3" edc:desc="Storage root key is locked and cannot be programmed" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BOOT_KEY_LOCK" edc:nzwidth="0x2" edc:desc="Lock bits for Secure Boot/OTA Key">
              <edc:SFRFieldSemantic edc:cname="BOOT_KEY_NOT_LCK_0" edc:desc="Secure boot key is not locked" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BOOT_KEY_LCK_1" edc:desc="Secure boot key is locked and cannot be programmed" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="BOOT_KEY_LCK_2" edc:desc="Secure boot key is locked and cannot be programmed" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="BOOT_KEY_LCK_3" edc:desc="Secure boot key is locked and cannot be programmed" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ADD_BOOT_KEY" edc:nzwidth="0x1" edc:desc="Additional boot Key bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xBFC" edc:_addr="0x44002C04"/>
      <edc:SFRDef ltx:memberofperipheral="ROT" edc:cname="SEC_BOOT" edc:nzwidth="0x20" edc:access="--------------nnnnnnnnnn------nn" edc:por="00000000000000010000000000000010" edc:mclr="00000000000000010000000000000010" edc:impl="0x3FF03" edc:_addr="0x44003800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ROT">
            <edc:SFRFieldDef edc:cname="SECURE_BOOT_REQD" edc:nzwidth="0x2" edc:desc="Bits to indicate that secure boot is required on the next device reset.">
              <edc:SFRFieldSemantic edc:cname="SEC_BOOT_REQD_0" edc:desc="Secure boot code authentication is required" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SEC_BOOT_NOT_REQD_1" edc:desc="Secure boot code authentication is NOT required" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SEC_BOOT_NOT_REQD_2" edc:desc="Secure boot code authentication is NOT required" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SEC_BOOT_REQD_3" edc:desc="Secure boot code authentication is required" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SEC_BOOT_STATUS" edc:nzwidth="0x8" edc:desc="Bits to indicate that secure boot status"/>
            <edc:SFRFieldDef edc:cname="SECURE_BOOT_DONE" edc:nzwidth="0x2" edc:desc="Bits to indicate that secure boot is done">
              <edc:SFRFieldSemantic edc:cname="SEC_BOOT_DONE_0" edc:desc="S ecure boot is done" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SEC_BOOT_NOT_DONE_1" edc:desc="S ecure boot is not done" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SEC_BOOT_NOT_DONE_2" edc:desc="S ecure boot is not done" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SEC_BOOT_DONE_3" edc:desc="S ecure boot is done" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
