Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:AdjustPoint edc:offset="0x1F4" edc:_addr="0x44003C0C"/>
      <edc:SFRDef ltx:memberofperipheral="DGI_SPI" edc:cname="SPICON" edc:nzwidth="0x20" edc:access="---n----n------nnnnnnn-nnn--nn-n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1081FDCD" edc:_addr="0x44003E00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DGI_SPI">
            <edc:SFRFieldDef edc:cname="GO" edc:nzwidth="0x1" edc:desc="DMA Operation Status bitThis bit is set by the user software to start the DMA operation. It is reset back to zero by the DMA engine whenthe DMA operation is completed or aborted by clearing the ON bit.">
              <edc:SFRFieldSemantic edc:cname="GO_NODMA" edc:desc="DMA is not in operation" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="GO_DMA" edc:desc="DMA is in operation" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STXISEL" edc:nzwidth="0x2" edc:desc="SPI Transmit Service Request Interrupt SelectFor enhanced buffer mode, the SPI generates a Transmit Service Request when:">
              <edc:SFRFieldSemantic edc:cname="SPIxTXB_SR_EMPTY" edc:desc="The SPIxTXB is empty and SPIxSR is empty (i.e. all transmit operations are complete)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SPIxTXB_EMPTY" edc:desc="The SPIxTXB is empty" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SPIxTXB_HALF_EMPTY" edc:desc="The SPIxTXB is at least half empty" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SPIxTXB_FULL" edc:desc="The SPIxTXB is not full" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CKP" edc:nzwidth="0x1" edc:desc="Clock Polarity Select bit">
              <edc:SFRFieldSemantic edc:cname="IDLE_LOW_ACTIVE_HIGH" edc:desc="Idle state for clock is a low level; active state is a high level" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IDLE_HIGH_ACTIVE_LOW" edc:desc="Idle state for clock is a high level; active state is a low level" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SSCON" edc:nzwidth="0x1" edc:desc="SSControl bits">
              <edc:SFRFieldSemantic edc:cname="SS_NOT_DMA" edc:desc="SS is not controlled by the DMA module" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SS_TXCNT" edc:desc="SS is asserted for the duration of TXCNT" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CKE" edc:nzwidth="0x1" edc:desc="SPI Clock Edge Select bit">
              <edc:SFRFieldSemantic edc:cname="TX_IDLE_TO_ACTIVE" edc:desc="Transmit happens on transition from idle clock state to active clock stat e" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TX_ACTIVE_TO_IDLE" edc:desc="Transmit happens on transition from active clock state to idle clock state" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x2" edc:desc="Serial Word Length bits"/>
            <edc:SFRFieldDef edc:cname="DISSDO" edc:nzwidth="0x1" edc:desc="Disable SDO bit">
              <edc:SFRFieldSemantic edc:cname="SDO_MACRO" edc:desc="SDO pin is controlled by the macro" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SDO_PORT" edc:desc="SDO pin is not used by the macro. Pin controlled by PORT function" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1" edc:desc="Stop in Idle control bit">
              <edc:SFRFieldSemantic edc:cname="SIDL_OPER_IDLE" edc:desc="Continue to operate in CPU Idle mode" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SIDL_HALT_IDLE" edc:desc="Halt in CPU Idle mode" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Freeze bit (in Debug Mode)">
              <edc:SFRFieldSemantic edc:cname="CONTINUE_DEBUG" edc:desc="Continue macro operation when in Debug mode" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BREAK_DEBUG" edc:desc="Break macro operation when in Debug mode" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1" edc:desc="DGISPI On bit">
              <edc:SFRFieldSemantic edc:cname="DISABLE_SFR" edc:desc="Turn off and reset macro, disable clocks, disable interrupt event generation, allow SFR modifications." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE_SFR" edc:desc="Enable macro" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ENHBUF" edc:nzwidth="0x1" edc:desc="Enhanced Buffer Enable bit">
              <edc:SFRFieldSemantic edc:cname="BUF_DISABLED" edc:desc="Enhanced Buffer Mode is disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BUF_ENABLED" edc:desc="Enhanced Buffer Mode is enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="MCLKEN" edc:nzwidth="0x1" edc:desc="Master Clock Enable">
              <edc:SFRFieldSemantic edc:cname="PBCLK_BRG" edc:desc="PBCLK is used by the BRG" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MCLK_BRG" edc:desc="MCLK is used by the BRG" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MSSEN" edc:nzwidth="0x1" edc:desc="Master Mode Slave Select Enable bit">
              <edc:SFRFieldSemantic edc:cname="SLAVE_DISABLED" edc:desc="Slave select SPI support disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SLAVE_ENABLED" edc:desc="SPI Slave Select support enabled " edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
