Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHECONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44012404"/>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHECONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44012408"/>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHECONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4401240C"/>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHESTAT" edc:nzwidth="0x20" edc:access="----nn------------------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC0000FF" edc:_addr="0x44012410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PCHE">
            <edc:SFRFieldDef edc:cname="PFMSECCNT" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="PFMSEC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFMDED" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHESTATCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44012414"/>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHESTATSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44012418"/>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHESTATINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4401241C"/>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHEHIT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44012420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PCHE">
            <edc:SFRFieldDef edc:cname="CHEHIT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHEHITCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44012424"/>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHEHITSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44012428"/>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHEHITINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4401242C"/>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHEMIS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44012430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PCHE">
            <edc:SFRFieldDef edc:cname="CHEMIS" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHEMISCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44012434"/>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHEMISSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44012438"/>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHEMISINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4401243C"/>
      <edc:AdjustPoint edc:offset="0x19C0" edc:_addr="0x44012440"/>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="SPICTRL" edc:nzwidth="0x20" edc:access="nn-----nnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC1FFFFFF" edc:_addr="0x44013E00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="SPIWDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="SPIADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PMUCRST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIRST" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="SPISTATUS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn------n" edc:por="00000000000000000000000000001000" edc:mclr="00000000000000000000000000001000" edc:impl="0xFFFFFF81" edc:_addr="0x44013E04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="SPIERR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SPIRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIRDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
