Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="PMUCMODE" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---nnnnnnnnnnnnn" edc:por="01000000000000000000000001000000" edc:mclr="01000000000000000000000001000000" edc:impl="0xFFFF1FFF" edc:_addr="0x44013E20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="CVREG4OCTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="SUPFSM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="CVREG3OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CVREG2OCTROL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="ADCBOR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKBOR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEXTBOR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CVREG1OCTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="CBUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CBUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="PMUSTATUS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF7F" edc:_addr="0x44013E24">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="PMUSTATUS" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="WCMRM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMUANA_BUCKBOR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BSSEDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="BSSENUM" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BSSERR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="PMUSEQ1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44013E28">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="CMPBVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIRADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="PMUSEQ2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44013E2C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="CMPBVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIRADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="PMUSEQ3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44013E30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="CMPBVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIRADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="PMUSEQ4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44013E34">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="CMPBVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIRADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="PMUCFG" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF7F" edc:_addr="0x44013E38">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="BUCK_SW_DELAY" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDO_SW_DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="MLDOEXT_l" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BUCK_CP_L" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="BUCK_CP_H" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="ADC_CP_L" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="ADC_CP_H" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44013E3C"/>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="PMU_VBCCMD" edc:nzwidth="0x20" edc:access="-n-n------------nnnnnnnnnnnnnnnn" edc:por="00010000000000000000000000000000" edc:mclr="00010000000000000000000000000000" edc:impl="0x5000FFFF" edc:_addr="0x44013E48">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="VBCADDR" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="VBCRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="PMU_VBCWDATA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44013E4C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="VBCWDATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="PMU_VBCRDATA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44013E50">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="VBCRDATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="WCMCFG" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x77" edc:_addr="0x44013E54">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="WCM1CFG" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WCM2CFG" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
