Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="EXCCNT" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0xE000100C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="EXCCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="SLEEPCNT" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0xE0001010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="SLEEPCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="LSUCNT" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0xE0001014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="LSUCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="FOLDCNT" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0xE0001018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="FOLDCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="PCSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000101C"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMP0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0001020"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="MASK0" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0xE0001024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="FUNCTION0" edc:nzwidth="0x20" edc:access="-------n----nnnnnnnnnnnnn-n-nnnn" edc:impl="0x10FFFAF" edc:_addr="0xE0001028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="FUNCTION" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EMITRANGE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CYCMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LNK1ENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVSIZE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR1" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MATCHED" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE000102C"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMP1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0001030"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="MASK1" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0xE0001034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="FUNCTION1" edc:nzwidth="0x20" edc:access="-------n----nnnnnnnnnnnnn-n-nnnn" edc:impl="0x10FFFAF" edc:_addr="0xE0001038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="FUNCTION" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EMITRANGE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CYCMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LNK1ENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVSIZE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR1" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MATCHED" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE000103C"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMP2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0001040"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="MASK2" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0xE0001044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="FUNCTION2" edc:nzwidth="0x20" edc:access="-------n----nnnnnnnnnnnnn-n-nnnn" edc:impl="0x10FFFAF" edc:_addr="0xE0001048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="FUNCTION" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EMITRANGE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CYCMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LNK1ENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVSIZE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR1" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MATCHED" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE000104C"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMP3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0001050"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="MASK3" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0xE0001054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="FUNCTION3" edc:nzwidth="0x20" edc:access="-------n----nnnnnnnnnnnnn-n-nnnn" edc:impl="0x10FFFAF" edc:_addr="0xE0001058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="FUNCTION" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EMITRANGE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CYCMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LNK1ENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVSIZE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR1" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MATCHED" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
