Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31048.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVD1" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVDR1" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="CVDT1" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="IOCB5" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RB5" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RPB5" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="TP5" edc:ppsfunction="RF__ANALOG" ltx:memberofperipheral="BTZBSYS"/>
      <edc:VirtualPin edc:name="FECTRL4" edc:ppsfunction="RF__DIGITAL" ltx:memberofperipheral="BTZBSYS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVD2" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVDR2" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="CVDT2" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="IOCB6" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RB6" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RPB6" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="FECTRL5" edc:ppsfunction="RF__DIGITAL" ltx:memberofperipheral="BTZBSYS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVD3" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVDR3" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="CVDT3" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="IOCB7" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RB7" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RPB7" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3"/>
      <edc:VirtualPin edc:name="ANN0" edc:ppsfunction="ADC__DIFFERENTIAL_" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="IOCA3" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="DACOUT" edc:ppsfunction="DAC" ltx:memberofperipheral="DAC_CTRL"/>
      <edc:VirtualPin edc:name="RA3" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="RPA3" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="RTCC" ltx:memberofperipheral="RTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB10"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="13" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="13" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="27" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="27" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="6" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="6" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="6" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="IOCB10" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RB10" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RPB10" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB11"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="14" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="14" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="14" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="27" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="6" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="6" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="IOCB11" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RB11" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RPB11" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="DATA2" edc:ppsfunction="SQI" ltx:memberofperipheral="QSPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="10" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="10" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="10" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="3" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="3" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="3" ltx:memberofperipheral="EIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="10" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="10" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="10" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="3" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="3" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="3" ltx:memberofperipheral="EIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PMU_MLDO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VPMU_VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PMU_BK"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
